
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Ограничим список выбора, для того чтобы пользователь смог выбрать только актуальные виды электронных документов.
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	АктуальныеВидыЭД = ОбменСКонтрагентамиСлужебныйВызовСервера.АктуальныеВидыЭлектронныхДокументов();
	
	ВидыЭДИсключения = Новый Массив;
	ВидыЭДИсключения.Добавить(Перечисления.ВидыЭД.Подтверждение);
	ВидыЭДИсключения.Добавить(Перечисления.ВидыЭД.ИзвещениеОПолучении);
	ВидыЭДИсключения.Добавить(Перечисления.ВидыЭД.УведомлениеОбУточнении);
	ВидыЭДИсключения.Добавить(Перечисления.ВидыЭД.ПредложениеОбАннулировании);
	
	СписокВыбора = ОбщегоНазначенияКлиентСервер.РазностьМассивов(АктуальныеВидыЭД, ВидыЭДИсключения);
	
	Для Каждого ВидЭД Из СписокВыбора Цикл
		ДанныеВыбора.Добавить(ВидЭД);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

