
Функция AuthorizationPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.АвторизацияПользователя(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");

	Возврат Ответ;	
	
КонецФункции

Функция CloseAuthorizationPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.АвторизацияПользователяЗакрыть(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;

	
	Возврат Ответ;
КонецФункции

Функция ShipmentsCreatePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.СодатьОтгрузку(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция СallСourierPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.СодатьВызовКурьера(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция CancelCouriercAllPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ОтменитьВызовКурьера(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция SaveCustomerRegistrationPOST(Запрос)
	//EFSOL_Шаповал Олег Анатольевич 16 августа 2017 г. 9:51:21 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.СохранитьРегистрациюКлиента(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL Шаповал О.А. -
КонецФункции

Функция GetInvoiceInfoPOST(Запрос)
		//EFSOL_Лохоня Юрий Анатольевич 16 августа 2017 г. 10:16:20 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьИнформациюПоЗаявке(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL_Лохоня Юрий Анатольевич -

КонецФункции

Функция MonitorInvoiceInfoPOST(Запрос)
	//EFSOL_Лохоня Юрий Анатольевич 16 августа 2017 г. 10:16:20 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьСтатутыПоЗаявкам(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL_Лохоня Юрий Анатольевич -

КонецФункции

Функция GetExtMonPOST(Запрос)
	//EFSOL_Лохоня Юрий Анатольевич 16 августа 2017 г. 10:16:20 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьСписокЗаказовПокупателя(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL_Лохоня Юрий Анатольевич -

КонецФункции

Функция GetOrdersPOST(Запрос)
	//EFSOL_Лохоня Юрий Анатольевич 08 сентября 2017 г. 11:26:54 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьЗаказыНаСбор(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL_Лохоня Юрий Анатольевич -
КонецФункции

Функция GetStickersPOST(Запрос)
	//EFSOL_Шаповал Олег Анатольевич 23 августа 2017 г. 12:03:12 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьНаклейки(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL Шаповал О.А. -
КонецФункции

Функция CustomerInfoPOST(Запрос)
	//EFSOL_Шаповал Олег Анатольевич 23 августа 2017 г. 21:20:37 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьИнформациюОКлиенте(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;	
	//EFSOL Шаповал О.А. -
КонецФункции

Функция TarifCalcPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьСтоимостьДоставки(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция pvzPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьСписокПВЗ(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция CityPOST(Запрос)
	//Ответ = Новый HTTPСервисОтвет(200);
	
	//Попытка
	//	Ответ = NS_API.ПолучитьСписокГородов(Запрос);
	//Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Метод не доступен/удален. "+ОписаниеОшибки());
	//КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция UseEntryNumberPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Попытка
		Ответ = NS_API.ПолучитьСтоимостьДоставкаНомерЗаказа(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция RoutePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьНаправление(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция GetInvoicePOST(Запрос)
	//EFSOL_Шаповал Олег Анатольевич 29 сентября 2017 г. 8:07:57 +
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьНакладную(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL Шаповал О.А. -
КонецФункции

Функция GetByNumberInvoicePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьЗаказПокупателя(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция HistoryStatusChangesInvoicesPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьИсториюИзмененияСтатусовЗаказа(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция TerminalPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьСписокСкладов(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция GetByPartNumberInvoice(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		Ответ = NS_API.ПолучитьЗаказыПокупателяПоЧастиНомера(Запрос);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции





