
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидФормыВыбора") Тогда
		Если Параметры.ВидФормыВыбора = "ВыборАдреса" Тогда
			
			Элементы.СтраницыВыбора.ТекущаяСтраница = Элементы.СтраницаВыборАдреса;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КонтрагентыКонтактнаяИнформация.Вид,
				|	КонтрагентыКонтактнаяИнформация.Представление
				|ИЗ
				|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
				|ГДЕ
				|	КонтрагентыКонтактнаяИнформация.Ссылка.Наименование = &Контрагент
				|	И КонтрагентыКонтактнаяИнформация.Тип = &Тип";
			
			Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
			
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					НовАдрес = СписокАдресов.Добавить();
					НовАдрес.Адрес = Выборка.Представление;
					НовАдрес.ВидАдреса = Выборка.Вид;
				КонецЦикла;
			Иначе
				Сообщить("Нет доступных для выбора адресов");
				Отказ = Истина;
			КонецЕсли;
			
		ИначеЕсли Параметры.ВидФормыВыбора = "ВыборКонтактногоЛица" Тогда

			Элементы.СтраницыВыбора.ТекущаяСтраница = Элементы.СтраницаВыборКонтактногоЛица;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			 |	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК КонтЛицо
			 |ИЗ
			 |	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент.Наименование = &Наименование) КАК СвязиКонтрагентКонтактСрезПоследних";
			Запрос.УстановитьПараметр("Наименование", Параметры.Контрагент);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
			
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					НовКонтЛицо = СписокКонтЛиц.Добавить();
					НовКонтЛицо.КонтактноеЛицо = Выборка.КонтЛицо;
				КонецЦикла;
			Иначе
				//ЕФСОЛ Несторук 10.10.2016 + Добавлено условие при открытия формы из ОтчетаОДоставке
				Если НЕ Параметры.Свойство("ЭтоОтчет") Тогда
					Сообщить("Контактные лица не найдены");
					Отказ = Истина;
				Иначе
					НовКонтЛицо = СписокКонтЛиц.Добавить();
					НовКонтЛицо.КонтактноеЛицо = Параметры.Контрагент;
				КонецЕсли;
				//Сообщить("Контактные лица не найдены");
				//Отказ = Истина;
				//ЕФСОЛ Несторук 10.10.2016 -
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.Имя = "СписокАдресов" Тогда
		Закрыть(СписокАдресов[ВыбраннаяСтрока].Адрес);
	ИначеЕсли Элемент.Имя = "СписокКонтЛиц" Тогда 	
		Закрыть(СписокКонтЛиц[ВыбраннаяСтрока].КонтактноеЛицо);
	Иначе
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры
