Процедура ПроверкаДостпуностиСервисаПриСтартеРаботыСистемыНаКлиенте() Экспорт
	
	СтруктураПроверки = ES_БиллингСервер.ПроверкаДостпуностиСервисаПриСтартеРаботыСистемы();
	ПредупредитьОНаступленииКрайнегоСрокаОплаты(СтруктураПроверки);
	
КонецПроцедуры

Процедура ПредупредитьОНаступленииКрайнегоСрокаОплаты(СтруктураПроверки) Экспорт
	
	Если СтруктураПроверки.Свойство("ДоступПолучен") и СтруктураПроверки.Свойство("КрайнийСрок") Тогда
		
		КрайнийСрок = СтруктураПроверки.КрайнийСрок;
		ДатаСервера = УправлениеНебольшойФирмойВызовСервера.ДатаСервера();
		РазницаДат = КрайнийСрок - ДатаСервера;	
		
		Если РазницаДат > 0 И РазницаДат < 3*24*3600 Тогда
			ТекстПредупреждения = Формат(КрайнийСрок, "ДФ='dd MMMM yyyy'") + " г., в "+ Формат(КрайнийСрок, "ДФ=HH:mm") +
			" истекает срок действия сервиса Delans. Пожалуйста, продлите дейтвие сервиса в личном кабинете на сайте:";
			Структура = Новый Структура;
			Структура.Вставить("ТекстПредупреждения", ТекстПредупреждения);
			Структура.Вставить("СсылкаНаСайт", Сайт42Обалка());
			ОткрытьФорму("ОбщаяФорма.ES_DelansПредупреждение", Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			//ПоказатьПредупреждение(, Формат(КрайнийСрок, "ДФ=dd.MMMM.yyyy") + " г., в "+ Формат(КрайнийСрок, "ДФ=hh:ss") +
			//" истекает срок действия сервиса Delans. Пожалуйста, продлите дейтвие сервиса в своем личном кабинете.",,"Предупреждение");
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьДоступностьСервисаDelans(Отказ) Экспорт
	
	Если ES_ОбщегоНазначенияКлиентСервер.ЭтоТестоваяСреда() Тогда
		Возврат;
	КонецЕсли;
		
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ ES_БиллингСервер.ПроверитьДоступностьСервисаDelans();
	
	Если Отказ Тогда
		ТекстПредупреждения = "Сервис Delans недоступен. Проверить статус сервиса можно в личном кабинете на сайте:";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения", ТекстПредупреждения);
		Структура.Вставить("СсылкаНаСайт", Сайт42Обалка());

		ОткрытьФорму("ОбщаяФорма.ES_DelansПредупреждение", Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//ПоказатьПредупреждение(, "Сервис Delans недоступен. Проверить статус сервиса можно в своем личном кабинете на сайте https://42clouds.com",, "Предупреждение");
	КонецЕсли;
			
КонецПроцедуры

Функция Сайт42Обалка() Экспорт
	
	Возврат "https://42clouds.com";
	
КонецФункции
