
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование = Параметры.Наименование;
	ТекДокИД = Параметры.ДокументИД;
	
	ОбновитьТаблицаДубли(Параметры.СтруктураСообщений.МассивСсылок);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицаДубли(МассивСсылок)
	
	ТаблицаДубли.Очистить();
	
	Для Каждого СсылкаДубль Из МассивСсылок Цикл
		СтрокаДубля = ТаблицаДубли.Добавить();	
		СтрокаДубля.ДокуменСсылка = СсылкаДубль;
		Если СсылкаДубль.ПометкаУдаления Тогда
			СтрокаДубля.СостояниеДокумента = 2;	
		ИначеЕсли СсылкаДубль.Проведен Тогда
			СтрокаДубля.СостояниеДокумента = 1;
		Иначе
			СтрокаДубля.СостояниеДокумента = 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторныйПоиск(Команда)
	
	МассивСсылок = ВладелецФормы.ПоискДублейВызовСервера(ТекДокИД);
	
	ОбновитьТаблицаДубли(МассивСсылок);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаписать(Команда)
	Закрыть(СсылкаДляЗамены);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДублиДокументДляПерезаписиПриИзменении(Элемент)
	
	СтрокаТекущиеДанные = Элементы.ТаблицаДубли.ТекущиеДанные;
	ТекущаяСсылка = СтрокаТекущиеДанные.ДокуменСсылка;
	Если СтрокаТекущиеДанные.ДокументДляПерезаписи Тогда
		СсылкаДляЗамены = СтрокаТекущиеДанные.ДокуменСсылка;
		Элементы.Перезаписать.Доступность = Истина;
	Иначе
		СсылкаДляЗамены = Неопределено;
		Элементы.Перезаписать.Доступность = Ложь;
	КонецЕсли;
	Для Каждого СтрокаДубля Из ТаблицаДубли Цикл
		Если СсылкаДляЗамены <> Неопределено И НЕ СтрокаДубля.ДокуменСсылка = СсылкаДляЗамены Тогда
			СтрокаДубля.ДокументДляПерезаписи = НЕ СтрокаТекущиеДанные.ДокументДляПерезаписи;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(Команда)
	Закрыть("Создать новый");
КонецПроцедуры
