
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Окно = Неопределено Тогда
		Источник = Неопределено;
		Уникальность = "ЗаказНаДоставку";
	Иначе
		Источник = ПараметрыВыполненияКоманды.Источник;
		Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ES_ФормаСпискаЗаказаНаДоставку", Новый Структура("ЗаказНаДоставку", Истина), Источник, Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры // ОбработкаКоманды()
