&НаКлиенте
Перем мСтрокаЗапуска;

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ 

// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    СисИнфо = Новый СистемнаяИнформация;
	ВерсияПрограммы = ЭтаФорма.Параметры.ВерсияПрограммы;
	Элементы.НадписьВерсия.Заголовок = ВерсияПрограммы;	
	Элементы.НадписьПродукт.Заголовок = " для 1C:Предприятия " + Лев(СисИнфо.ВерсияПриложения, 3); 
	Элементы.НадписьКонфигурация.Заголовок = ""+Метаданные.Синоним + " (" + Метаданные.Версия + ")"; 
	
	//Письмо = "mailto:support@42clouds.com?"+
	//			 	"&subject=""EFSOL: Загрузка документов для 1C v8"""+
	//			 	"&body=""======================================================================== %0D%0A"+
	//			 			"Продукт  : EFSOL: Загрузка документов для 1C v8%0D%0A"+
	//			 			"Версия   : "+ВерсияПрограммы+"%0D%0A"+
	//			 			"Конфигурация  : "+Метаданные.Имя+"%0D%0A"+
	//			 			"Поставщик конфигурации : "+Метаданные.Поставщик+"%0D%0A"+
	//			 			"Версия конфигурации : "+Метаданные.Версия+"%0D%0A"+
	//			 			"======================================================================== """;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + ВладелецФормы.ИмяПрограммы;
	Элементы.НадписьПродукт.Заголовок = ВладелецФормы.ИмяПрограммы + Элементы.НадписьПродукт.Заголовок; 
	
	Элементы.ЛоготипRICOH.Видимость = ВладелецФормы.RICOH;
	Элементы.ЛоготипEFSOL.Видимость = НЕ ВладелецФормы.RICOH;
	Элементы.Декорация2.Видимость = НЕ ВладелецФормы.RICOH;
	Элементы.ГруппаWebСайт.Видимость = НЕ ВладелецФормы.RICOH;	  
	Элементы.ГруппаТехподдержка.Видимость = НЕ ВладелецФормы.RICOH;
	
КонецПроцедуры


// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет запуск приложения мСтрокаЗапуска
//
&НаКлиенте
Процедура СлужебнаяПроцедура()

	//Если НЕ ВладелецФормы.ТерминальныйСервер Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("ПустойОбработчикОповещения", ВладелецФормы);
	НачатьЗапускПриложения(ОписаниеОповещения, мСтрокаЗапуска);	
	//КонецЕсли;
	
КонецПроцедуры // СлужебнаяПроцедура()

// Пустая процедура - обработкчик оповещения
&НаКлиенте
Процедура ПустойОбработчикОповещения(Результат, ДопПараметры) Экспорт
 
 //Ничего не нужно делать, но наличие процедуры обязательно
 
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обработчик события элемента НадписьWebСайт "Нажатие"
//
&НаКлиенте
Процедура НадписьWebСайтНажатие(Элемент)
	
	мСтрокаЗапуска = "http://efsol.ru/products/document-upload.html";
	ПодключитьОбработчикОжидания("СлужебнаяПроцедура",1, Истина);	
	
КонецПроцедуры

// Процедура - обработчик события элемента НадписьТехподдержкаWebСайт "Нажатие"
//
&НаКлиенте
Процедура НадписьТехподдержкаWebСайтНажатие(Элемент)
	
	мСтрокаЗапуска = "http://efsol.ru";
	ПодключитьОбработчикОжидания("СлужебнаяПроцедура",1, Истина);	
	
КонецПроцедуры

// Процедура - обработчик события элемента НадписьMail "Нажатие"
//
&НаКлиенте
Процедура НадписьMailНажатие(Элемент)
	
	//мСтрокаЗапуска = Письмо;
	//ПодключитьОбработчикОжидания("СлужебнаяПроцедура",1, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	СчетчикНажатий = СчетчикНажатий + 1;
	Если СчетчикНажатий = 5 Тогда 
		//ВладелецФормы.ЮнитТест();
		ОткрытьФорму(ВладелецФормы.ПрефиксИмениФорм + "ФормаТестированияНечеткогоПоиска",,ВладелецФормы);
	КонецЕсли;	
	
КонецПроцедуры


