
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик нажатия на кнопку ОтборДень.
//
&НаКлиенте
Процедура ОтборДень(Команда)
	
	НастройкаПериода = Элементы.Список.Период;
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.Сегодня;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборДень()

// Процедура - обработчик нажатия на кнопку ОтборНеделя.
//
&НаКлиенте
Процедура ОтборНеделя(Команда)
	
	НастройкаПериода = Элементы.Список.Период;
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборНеделя()

// Процедура - обработчик нажатия на кнопку ОтборМесяц.
//
&НаКлиенте
Процедура ОтборМесяц(Команда)
	
	НастройкаПериода = Элементы.Список.Период;
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборМесяц()

// Процедура - обработчик нажатия на кнопку ОтборОчистить.
//
&НаКлиенте
Процедура ОтборОчистить(Команда)
	
	НастройкаПериода = Элементы.Список.Период;
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	НастройкаПериода.ДатаНачала = '00010101';
	НастройкаПериода.ДатаОкончания = '00010101';
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборОчистить()

// НЕ ИСПОЛЬЗУЕТСЯ
&НаКлиенте
Процедура ОтборИсполнительПриИзменении(Элемент)
		
	//УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Исполнитель", ОтборИсполнитель, ЗначениеЗаполнено(ОтборИсполнитель));
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКомандыПланДоставки);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.

КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
