// ++ Русанова М.Л. 03.04.2019 (

&Вместо ("ВключитьИсключитьИзГруппы")
&НаКлиенте
Процедура Efsol_ВключитьИсключитьИзГруппы(ГруппаДоступа, ВключитьВГруппуДоступа) Экспорт
	
	Если ТипЗнч(ГруппаДоступа) <> Тип("СправочникСсылка.ГруппыДоступа")
	  ИЛИ НЕ ЗначениеЗаполнено(ГруппаДоступа) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГруппаДоступа", ГруппаДоступа);
	ДополнительныеПараметры.Вставить("ВключитьВГруппуДоступа", ВключитьВГруппуДоступа);
	
	//Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено
	//   И ГруппаДоступа = ПредопределенноеЗначение("Справочник.ГруппыДоступа.Администраторы") Тогда
	//	
	//	ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
	//		Новый ОписаниеОповещения(
	//			"ВключитьИсключитьИзГруппыЗавершение", ЭтотОбъект, ДополнительныеПараметры),
	//		ЭтотОбъект,
	//		ПарольПользователяСервиса);
	//	Возврат;
	//Иначе
		ЭтотОбъект.ВключитьИсключитьИзГруппыЗавершение(Null, ДополнительныеПараметры);
	//КонецЕсли;
	
КонецПроцедуры

// -- Русанова М.Л. 03.04.2019 