&После("ПриОпределенииВидовПодключаемыхКоманд") 
Процедура Efsol_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	CTSM_ПодключаемыеКоманды_EfsolПервичныйДокумент.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);	
КонецПроцедуры


&После("ПриОпределенииКомандПодключенныхКОбъекту") 
Процедура Efsol_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	CTSM_ПодключаемыеКоманды_EfsolПервичныйДокумент.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);			
КонецПроцедуры
