
#Область Служебные

&НаКлиенте
Процедура ДобавитьДокументКакОснованиеСчетФактуры()
	
	ТекущиеДанные = Элементы.ОснованияСчетаФактурыПолученного.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ВыполненаКоманда", КодВозвратаДиалога.OK);
	СтруктураВыбора.Вставить("Документ", ТекущиеДанные.ДокументСсылка);
	
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

&НаСервере
Функция МассивДокументовСвыставленнымиСчетамиФактура()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Параметры.Ссылка);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	Запрос.УстановитьПараметр("Договор", Параметры.Договор);
	
	Запрос.Текст =
	"Выбрать
	|	СчетФактураПолученный.ДокументОснование КАК Ссылка
	|Из Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|Где СчетФактураПолученный.Ссылка <> &ТекущийДокумент
	|	И СчетФактураПолученный.Организация = &Организация
	|	И СчетФактураПолученный.Контрагент = &Контрагент
	|	И СчетФактураПолученный.Договор = &Договор
	|";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОснованияСчетаФактурыПолученного, "Организация",	Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОснованияСчетаФактурыПолученного, "Контрагент",	Параметры.Контрагент, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	Если Параметры.АвансыДоступны = Ложь Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОснованияСчетаФактурыПолученного, "Договор",	Параметры.Договор, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОснованияСчетаФактурыПолученного, "ПоступленияДоступны", Параметры.ПоступленияДоступны, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОснованияСчетаФактурыПолученного, "КомиссияДоступна", Параметры.КомиссияДоступна, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОснованияСчетаФактурыПолученного, "АвансыДоступны", Параметры.АвансыДоступны, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОснованияСчетаФактурыПолученного, "КорректировкиДоступны", Параметры.КорректировкиДоступны, Истина);
	
	МассивДокументов = МассивДокументовСВыставленнымиСчетамиФактура();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОснованияСчетаФактурыПолученного, "ДокументСсылка", МассивДокументов, ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	
	ЗаголовокОрганизации = НСтр("ru ='Организация: %1'");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтборОрганизация", "Заголовок", СтрШаблон(ЗаголовокОрганизации, Параметры.Организация));
	
	ЗаголовокКонтрагента = НСтр("ru ='Контрагент: %1 (%2)'");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтборКонтрагентДоговор", "Заголовок", СтрШаблон(ЗаголовокКонтрагента, Параметры.Контрагент, Параметры.Договор));
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ВыбратьДокументОснование(Команда)
	
	ДобавитьДокументКакОснованиеСчетФактуры();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОснованияНаРеализациюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьДокументКакОснованиеСчетФактуры();
	
КонецПроцедуры

#КонецОбласти