// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	//ИДДокумента = Параметры.ИДДокумента;
	ИмяКоманды = Параметры.ИмяКоманды;
	СтруктураДокумента = Параметры.СтруктураДокумента;
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриОткрытии"
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИмяКоманды = "Команда2" Тогда
		
		//МассивСтрок = ВладелецФормы.ТаблицаДанных.НайтиСтроки(Новый Структура("ДокументИД, ЭтоСделка", ИДДокумента, 1));
		//Документ = МассивСтрок[0]; 
		Документ = СтруктураДокумента;
		Шапка = Документ.Шапка;
		
		СтруктураОписанияДокумента = Неопределено;
		ВладелецФормы.СтруктураОписанийДокументов.Свойство(Документ.ВидДокумента, СтруктураОписанияДокумента);
		ОписаниеШапки = СтруктураОписанияДокумента.Шапка;
		Для Каждого Структура Из ОписаниеШапки Цикл
			Если Структура.Родитель = "ЦеныИВалюты" И НЕ Структура.Идентификатор = "СтруктураКурсаВзаиморасчетов" Тогда
				НоваяСтрока = ТаблицаДополнительныхРеквизитов.Добавить();
				НоваяСтрока.Идентификатор = Структура.Идентификатор;
				НоваяСтрока.Представление = Структура.Синоним;
				Если Структура.Идентификатор = "НалогообложениеНДС" И ВладелецФормы.ИмяШаблона = "УправлениеНебольшойФирмой 1.6" Тогда
					Если Строка(Шапка[Структура.Идентификатор].ИтоговоеЗначение) = "Не облагается (без НДС)" Тогда
						Если Документ.ВидДокумента = "ПТУ" ИЛИ Документ.ВидДокумента = "ПТ" ИЛИ Документ.ВидДокумента = "ЗП" ИЛИ Документ.ВидДокумента = "ПН" Тогда
							НоваяСтрока.Значение = "Закупка не облагается НДС";
						ИначеЕсли Документ.ВидДокумента = "РТУ" ИЛИ Документ.ВидДокумента = "РТ" ИЛИ Документ.ВидДокумента = "РН" Тогда
							НоваяСтрока.Значение = "Продажа не облагается НДС";
						КонецЕсли;
					Иначе
						Если Документ.ВидДокумента = "ПТУ" ИЛИ Документ.ВидДокумента = "ПТ" ИЛИ Документ.ВидДокумента = "ЗП" ИЛИ Документ.ВидДокумента = "ПН" Тогда
							НоваяСтрока.Значение = "Закупка облагается НДС";
						ИначеЕсли Документ.ВидДокумента = "РТУ" ИЛИ Документ.ВидДокумента = "РТ" ИЛИ Документ.ВидДокумента = "РН" Тогда
							НоваяСтрока.Значение = "Продажа облагается НДС";
						КонецЕсли;
					КонецЕсли;
				Иначе
					НоваяСтрока.Значение = Шапка[Структура.Идентификатор].ИтоговоеЗначение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды формы "Сохранить"
//
&НаКлиенте
Процедура Сохранить(Команда)
	
	//МассивСтрок = ВладелецФормы.ТаблицаДанных.НайтиСтроки(Новый Структура("ДокументИД, ЭтоСделка", ИДДокумента, 1));
	//Документ = МассивСтрок[0];
	//
	Документ = СтруктураДокумента;

	СтруктураИзменяемыхРеквизитов = Новый Структура();
	Для каждого СтрокаТабл Из ТаблицаДополнительныхРеквизитов Цикл
		Если Документ.Шапка.Свойство(СтрокаТабл.Идентификатор) Тогда
			Если Документ.Шапка[СтрокаТабл.Идентификатор].ИтоговоеЗначение <> СтрокаТабл.Значение Тогда
				СтруктураИзменяемыхРеквизитов.Вставить(СтрокаТабл.Идентификатор, СтрокаТабл.Значение);
				Если НЕ ВладелецФормы.ИмяШаблона = "БухгалтерияПредприятия 3.0" И НЕ ВладелецФормы.ИмяШаблона = "Розница 2.2" И ТипЗнч(Документ.Шапка[СтрокаТабл.Идентификатор].ИтоговоеЗначение) = Тип("ПеречислениеСсылка.ТипыНалогообложенияНДС") Тогда
					Документ.Шапка[СтрокаТабл.Идентификатор].ИтоговоеЗначение = ВернутьТипНалогообложения(Найти(СтрокаТабл.Значение, "не облагается") > 0);
				Иначе
					Документ.Шапка[СтрокаТабл.Идентификатор].ИтоговоеЗначение = СтрокаТабл.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Если ИмяКоманды = "Команда2" Тогда
		
		Оповестить("ИзмененыЦеныИВалюта", Новый Структура("СтруктураДокумента, СтруктураИзменяемыхРеквизитов", СтруктураДокумента, СтруктураИзменяемыхРеквизитов));		
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события элемента ТаблицаДополнительныхРеквизитов "ПриАктивизацииЯчейки"
//
&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.ТаблицаДополнительныхРеквизитов.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ТаблицаДополнительныхРеквизитов.НайтиПоИдентификатору(Элементы.ТаблицаДополнительныхРеквизитов.ТекущаяСтрока);
	ИДКолонки = СтрЗаменить(Элементы.ТаблицаДополнительныхРеквизитов.ТекущийЭлемент.Имя, "ТаблицаДополнительныхРеквизитов", "");	
	
	ИмяЭлемента = ТекущаяСтрока.Идентификатор;
	ЗначениеЭлемента = Элементы.ТаблицаДополнительныхРеквизитов.ТекущиеДанные.Значение;
	
	СтруктураНастроекЯчейки = Новый Структура("КнопкаОткрытия, КнопкаСпискаВыбора, КнопкаОчистки, ВыбиратьТип, БыстрыйВыбор, РедактированиеТекста,  РежимВыбораИзСписка, ВыборГруппИЭлементов, ТолькоПросмотр, КнопкаВыбора", 
	Ложь, Ложь, Ложь, Ложь, Ложь, Истина, Ложь, ГруппыИЭлементы.ГруппыИЭлементы, Ложь, Ложь);
	
	Попытка
		Элементы.ТаблицаДополнительныхРеквизитов.ПодчиненныеЭлементы.ТаблицаДополнительныхРеквизитовЗначение.КнопкаВыпадающегоСписка = Ложь;
		СтруктураНастроекЯчейки.Удалить("КнопкаСпискаВыбора");
		СтруктураНастроекЯчейки.Вставить("КнопкаВыпадающегоСписка", Ложь);
	Исключение	
	КонецПопытки;
	
	СтруктураИзменяемыхРеквизитов = Новый Структура();
	
	Для каждого СтрокаТабл Из ТаблицаДополнительныхРеквизитов Цикл
		СтруктураИзменяемыхРеквизитов.Вставить(СтрокаТабл.Идентификатор, СтрокаТабл.Значение);
	КонецЦикла;	
	
	СписокВыбораДляЭлемента = Новый СписокЗначений;
	//МассивДокументов = ВладелецФормы.ТаблицаДанных.НайтиСтроки(Новый Структура("ДокументИД, ЭтоСделка", ИДДокумента, 1));
	//Если МассивДокументов.Количество() > 0 Тогда
	//	Документ = МассивДокументов[0];
	//КонецЕсли;
	Документ = СтруктураДокумента;
	СтруктураОписанияДокумента = Неопределено;
	ВладелецФормы.СтруктураОписанийДокументов.Свойство(Документ.ВидДокумента, СтруктураОписанияДокумента);
	ОписаниеРеквизита = ВладелецФормы.ВладелецФормы.НайтиВМассивеСтруктурНаСервере(СтруктураОписанияДокумента.Шапка, ИмяЭлемента, "Идентификатор");
	Если ОписаниеРеквизита = Неопределено Тогда
		СтруктураНастроекЯчейки.Удалить("КнопкаОткрытия");
		СтруктураНастроекЯчейки.ТолькоПросмотр = Истина;
	Иначе
		
		ТипРеквизита = ОписаниеРеквизита.Тип;
		ВидРеквизита = ОписаниеРеквизита.Вид;
		ТипВидРеквизита = ?(ПустаяСтрока(ТипРеквизита), "", ТипРеквизита + "." + ВидРеквизита);
				
		Если ТипРеквизита = "Строка" Тогда
			Если ОписаниеРеквизита.Идентификатор = "НалогообложениеНДС" Тогда
				Если СтруктураНастроекЯчейки.Свойство("КнопкаВыпадающегоСписка") Тогда
					СтруктураНастроекЯчейки.КнопкаВыпадающегоСписка = Истина;
				Иначе
					СтруктураНастроекЯчейки.Удалить("КнопкаСпискаВыбора");
					СтруктураНастроекЯчейки.КнопкаСпискаВыбора = Истина;
					СтруктураНастроекЯчейки.Вставить("КнопкаВыпадающегоСписка", Истина);
				КонецЕсли;
				Если ИмяЭлемента = "НалогообложениеНДС" Тогда
					Если Документ.ВидДокумента = "ПТУ" ИЛИ Документ.ВидДокумента = "ПТ" ИЛИ Документ.ВидДокумента = "ЗП" ИЛИ Документ.ВидДокумента = "ПН" Тогда
						СписокВыбораДляЭлемента.Добавить("Закупка не облагается НДС");
						СписокВыбораДляЭлемента.Добавить("Закупка облагается НДС");
					ИначеЕсли Документ.ВидДокумента = "РТУ" ИЛИ Документ.ВидДокумента = "РТ" ИЛИ Документ.ВидДокумента = "РН" Тогда
						СписокВыбораДляЭлемента.Добавить("Продажа не облагается НДС");
						СписокВыбораДляЭлемента.Добавить("Продажа облагается НДС");
					КонецЕсли;						
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипРеквизита = "Число" Тогда
			СтруктураНастроекЯчейки.Удалить("БыстрыйВыбор");
			СтруктураНастроекЯчейки.Удалить("ВыборГруппИЭлементов");
		ИначеЕсли ТипРеквизита = "Дата" Тогда
			СтруктураНастроекЯчейки.КнопкаВыбора = Истина;	
		ИначеЕсли ТипРеквизита = "Булево" Тогда
			СтруктураНастроекЯчейки.КнопкаВыбора = Истина;
		ИначеЕсли ТипРеквизита = "СправочникСсылка" Тогда
			СтруктураНастроекЯчейки.КнопкаВыбора = Истина;
			Если ТипЗнч(ЗначениеЭлемента) = Тип(ТипВидРеквизита) Тогда
				СтруктураНастроекЯчейки.КнопкаОткрытия = Истина;
				СтруктураНастроекЯчейки.КнопкаОчистки = Истина;
			КонецЕсли;
		ИначеЕсли ТипРеквизита = "ПеречислениеСсылка" Тогда
			Если ОписаниеРеквизита.Идентификатор = "НалогообложениеНДС" Тогда
				Если СтруктураНастроекЯчейки.Свойство("КнопкаВыпадающегоСписка") Тогда
					СтруктураНастроекЯчейки.КнопкаВыпадающегоСписка = Истина;
				Иначе
					СтруктураНастроекЯчейки.Удалить("КнопкаСпискаВыбора");
					СтруктураНастроекЯчейки.КнопкаСпискаВыбора = Истина;
					СтруктураНастроекЯчейки.Вставить("КнопкаВыпадающегоСписка", Истина);
				КонецЕсли;
				Если ИмяЭлемента = "НалогообложениеНДС" Тогда
					Если Документ.ВидДокумента = "ПТУ" ИЛИ Документ.ВидДокумента = "ПТ" ИЛИ Документ.ВидДокумента = "ЗП" ИЛИ Документ.ВидДокумента = "ПН" Тогда
						СписокВыбораДляЭлемента.Добавить("Закупка не облагается НДС");
						СписокВыбораДляЭлемента.Добавить("Закупка облагается НДС");
					ИначеЕсли Документ.ВидДокумента = "РТУ" ИЛИ Документ.ВидДокумента = "РТ" ИЛИ Документ.ВидДокумента = "РН" Тогда
						СписокВыбораДляЭлемента.Добавить("Продажа не облагается НДС");
						СписокВыбораДляЭлемента.Добавить("Продажа облагается НДС");
					КонецЕсли;						
				КонецЕсли;
			Иначе
				Если СтруктураНастроекЯчейки.Свойство("КнопкаВыпадающегоСписка") Тогда
					СтруктураНастроекЯчейки.КнопкаВыпадающегоСписка = Истина;
					СтруктураНастроекЯчейки.КнопкаВыбора = Истина;
				Иначе
					СтруктураНастроекЯчейки.Удалить("КнопкаСпискаВыбора");
					СтруктураНастроекЯчейки.Вставить("КнопкаВыпадающегоСписка", Истина);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипРеквизита = "ПланСчетовСсылка" Тогда
			СтруктураНастроекЯчейки.КнопкаВыбора = Истина;
		ИначеЕсли ПустаяСтрока(ТипВидРеквизита) Тогда
			СтруктураНастроекЯчейки.ТолькоПросмотр = Истина;		
		КонецЕсли;
		
		Если ИмяЭлемента = "СуммаВключаетНДС" Тогда
			Если (СтруктураИзменяемыхРеквизитов.Свойство("УчитыватьНДС") И НЕ СтруктураИзменяемыхРеквизитов.УчитыватьНДС) ИЛИ 
				(СтруктураИзменяемыхРеквизитов.Свойство("НалогообложениеНДС") И (Найти(СтруктураИзменяемыхРеквизитов.НалогообложениеНДС, "не облагается") > 0)) Тогда
				СтруктураНастроекЯчейки.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ИзменяемыйЭлемент Из СтруктураНастроекЯчейки Цикл
		Элементы.ТаблицаДополнительныхРеквизитов.ПодчиненныеЭлементы.ТаблицаДополнительныхРеквизитовЗначение[ИзменяемыйЭлемент.Ключ] = ИзменяемыйЭлемент.Значение;
	КонецЦикла;
	
	Элементы.ТаблицаДополнительныхРеквизитов.ПодчиненныеЭлементы.ТаблицаДополнительныхРеквизитовЗначение.СписокВыбора.Очистить();	
	Если СписокВыбораДляЭлемента.Количество() > 0 Тогда
		Для Каждого Элем Из СписокВыбораДляЭлемента Цикл
			Элементы.ТаблицаДополнительныхРеквизитов.ПодчиненныеЭлементы.ТаблицаДополнительныхРеквизитовЗначение.СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

// Процедура - обработчик события элемента ТаблицаДополнительныхРеквизитовЗначение "ОбработкаВыбора"
//
&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элементы.ТаблицаДополнительныхРеквизитов.ТекущиеДанные.Значение = ВыбранноеЗначение;
	
КонецПроцедуры

// Процедура - обработчик события элемента ТаблицаДополнительныхРеквизитов "ПриИзменении"
//
&НаКлиенте
Процедура ТаблицаДополнительныхРеквизитовПриИзменении(Элемент)
	
	ТекущаяСтрока = ТаблицаДополнительныхРеквизитов.НайтиПоИдентификатору(Элементы.ТаблицаДополнительныхРеквизитов.ТекущаяСтрока);
	ИДКолонки = СтрЗаменить(Элементы.ТаблицаДополнительныхРеквизитов.ТекущийЭлемент.Имя, "ТаблицаДополнительныхРеквизитов", "");	
	
	ИмяЭлемента = ТекущаяСтрока.Идентификатор;
	ЗначениеЭлемента = Элементы.ТаблицаДополнительныхРеквизитов.ТекущиеДанные.Значение;
	СтароеЗначение = 1;	
	
	СтруктураИзменяемыхРеквизитов = Новый Структура();
	Для каждого СтрокаТабл Из ТаблицаДополнительныхРеквизитов Цикл
		СтруктураИзменяемыхРеквизитов.Вставить(СтрокаТабл.Идентификатор, СтрокаТабл.Значение);
	КонецЦикла;	
	
	Если ИмяЭлемента = "УчитыватьНДС" Тогда
		Если НЕ ЗначениеЭлемента Тогда
			Попытка
				СтруктураИзменяемыхРеквизитов.ЦенаВключаетНДС = Ложь;
			Исключение
				СтруктураИзменяемыхРеквизитов.СуммаВключаетНДС = Ложь;
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ИмяЭлемента = "НалогообложениеНДС" Тогда
		Если ЗначениеЭлемента = "Продажа не облагается НДС" ИЛИ ЗначениеЭлемента = "Закупка не облагается НДС" Тогда
			Если СтруктураИзменяемыхРеквизитов.Свойство("СуммаВключаетНДС") Тогда
				СтруктураИзменяемыхРеквизитов.СуммаВключаетНДС = Ложь;
			Иначе
				СтруктураИзменяемыхРеквизитов.ЦенаВключаетНДС = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураИзменяемыхРеквизитов = СтруктураИзменяемыхРеквизитов;
	Для каждого СтрокаТабл Из ТаблицаДополнительныхРеквизитов Цикл
		СтрокаТабл.Значение = СтруктураИзменяемыхРеквизитов[СтрокаТабл.Идентификатор];
	КонецЦикла;
	
КонецПроцедуры

// Получение значения типа налогообложения
//
&НаСервереБезКонтекста
Функция ВернутьТипНалогообложения(НеОблагается)
	
	Если  НеОблагается Тогда
		Значение = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	Иначе
		Значение = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	КонецЕсли;
	
	Возврат Значение;
КонецФункции



// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
