
&НаКлиенте
Процедура ЗаписатьУведомление(ВажнаяИнформация,ОтправитьУведомление, Текст) Экспорт
	//EFSOL Шаповал О.А. 03.08.2018 15:41:28 {
	ОтправитьУведомление = Истина;
	Если ВажнаяИнформация <> "" Тогда
		ВажнаяИнформация = ВажнаяИнформация + Символы.ПС +
							"Дополнительно: " + СокрЛП(Текст);
	Иначе 
		ВажнаяИнформация = СокрЛП(Текст);
	КонецЕсли;
	//}EFSOL Шаповал О.А.	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьУведомление(ВажнаяИнформация,ОтправитьУведомление, Курьер) Экспорт
	////EFSOL Шаповал О.А. 03.08.2018 15:41:28 {
	//Если ОтправитьУведомление Тогда
	//	Уведомление = Новый ДоставляемоеУведомление();
	//	Уведомление.Текст = ВажнаяИнформация;
	//	ES_РаботаСДоставляемымиУведомлениями.ОтправитьУведомление(Уведомление,Курьер);
	//КонецЕсли;
	////}EFSOL Шаповал О.А.	
КонецПроцедуры