
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// НЕ ИСПОЛЬЗУТСЯ
// Процедура - обработчик нажатия на кнопку ОтборДень.
//
&НаКлиенте
Процедура ОтборДень(Команда)
	
	//НастройкаПериода = Элементы.Список.Период;
	//НастройкаПериода.Вариант = ВариантСтандартногоПериода.Сегодня;
	//
	//Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборДень()

// НЕ ИСПОЛЬЗУТСЯ
// Процедура - обработчик нажатия на кнопку ОтборНеделя.
//
&НаКлиенте
Процедура ОтборНеделя(Команда)
	
	//НастройкаПериода = Элементы.Список.Период;
	//НастройкаПериода.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	//
	//Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборНеделя()

// НЕ ИСПОЛЬЗУТСЯ
// Процедура - обработчик нажатия на кнопку ОтборМесяц.
//
&НаКлиенте
Процедура ОтборМесяц(Команда)
	
	//НастройкаПериода = Элементы.Список.Период;
	//НастройкаПериода.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	//
	//Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборМесяц()

// НЕ ИСПОЛЬЗУТСЯ
// Процедура - обработчик нажатия на кнопку ОтборОчистить.
//
&НаКлиенте
Процедура ОтборОчистить(Команда)
	
	//НастройкаПериода = Элементы.Список.Период;
	//НастройкаПериода.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	//НастройкаПериода.ДатаНачала = '00010101';
	//НастройкаПериода.ДатаОкончания = '00010101';
	//
	//Элементы.Список.Обновить();
	
КонецПроцедуры // ОтборОчистить()


////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     	
	
	//ES_Сережко А.С. 07.02.18
	// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКомандыВозврат);
	// Конец СтандартныеПодсистемы.Печать  	
	//ES_Сережко А.С. 07.02.18
	//ES_Сережко А.С. 07.02.18	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//ES_Сережко А.С. 07.02.18

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуПодключаемойКоманды(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

