
Процедура ОтправитьУведомление( Уведомление,Курьер) Экспорт
	//EFSOL Шаповал О.А. 03.08.2018 16:07:14 {
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Оборудование КАК Оборудование,
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Курьер КАК Курьер,
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.ID КАК ID
	               |ИЗ
	               |	РегистрСведений.ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров КАК ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров
	               |ГДЕ
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Курьер  = &Курьер";
	
	Запрос.УстановитьПараметр("Курьер",Курьер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыУстройства = Выборка.ID.Получить();
		Если ПараметрыУстройства = Неопределено Тогда
			Продолжить;
		Иначе
			Уведомление.Получатели.Добавить(Выборка.ID.Получить());
		КонецЕсли;
	КонецЦикла;
		
	Если Уведомление.Получатели.Количество() > 0 Тогда
		ДанныеАутентификации = "";
		Сертификат = Неопределено;
		//КлючGoogle = СокрЛП(Константы.ES_КлючДоступа.Получить());
		КлючGoogle = "AIzaSyDxTaQvvje27lH8JEHiMNrcBFnlpyziVP4";
		// новый ключ Деланса = AIzaSyBqkBG9uorb-4m0azgGwswKiJZndsRcz60
		ДанныеАутентификации = Новый Соответствие; 
		ДанныеАутентификации.Вставить(ТипПодписчикаДоставляемыхУведомлений.GCM, КлючGoogle);
		УдаленныеТокены = Новый Массив;
		ИнформацияОПроблемеОтправкиДоставляемогоУведомления = Новый Массив;
		Попытка
			ОтправкаДоставляемыхУведомлений.Отправить(Уведомление,ДанныеАутентификации,УдаленныеТокены,Ложь);
		Исключение
		КонецПопытки;
		НеИспользоватьИдентификаторы(УдаленныеТокены);
	КонецЕсли;
	//}EFSOL Шаповал О.А.	
КонецПроцедуры

Процедура НеИспользоватьИдентификаторы (УдаленныеТокены)
	//EFSOL Шаповал О.А. 03.08.2018 17:41:11 {
	
	//}EFSOL Шаповал О.А.
КонецПроцедуры