
&НаКлиенте
Процедура Выбрать(Команда)
	
	СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов."+ СтрЗаменить(НовыйСтатус, " ", ""));
	СтатусЗабораДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаборов."+ СтрЗаменить(НовыйСтатус, " ", ""));
	Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;
	СписокГрузов = ЭтаФорма.ВладелецФормы.Объект.СписокГрузов;
	Грузы = ЭтаФорма.ВладелецФормы.Объект.Грузы;
	Для каждого Стр из Заказы Цикл
		Если Стр.Отметка = Истина Тогда
			Если ТипЗнч(Стр.ДокументДоставки) = Тип("ДокументСсылка.ЗаказПокупателя") И НЕ СтатусЗаказаДляИзменения = Неопределено  Тогда
				Если НЕ СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.Отменен") Тогда
					Стр.СтатусЗаказа = СтатусЗаказаДляИзменения;
				КонецЕсли;
				Если СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.Доставлен") 
					ИЛИ СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.ЧастичноДоставлен") Тогда
					
					Если (СписокГрузов.Количество() = 0 И Грузы.Количество() = 0) Тогда 
						
						Стр.НПФактНал = Стр.НППлан;
					Иначе 
						НайденныеСтроки = СписокГрузов.НайтиСтроки(Новый Структура("ДокументДоставки", Стр.ДокументДоставки));
						
						НПФактСписокГрузов = 0;
						Если НайденныеСтроки.Количество() > 0 Тогда
							Для каждого Строка Из НайденныеСтроки Цикл
								
								НПФактСписокГрузов = НПФактСписокГрузов + Строка.НПФакт;
								
							КонецЦикла;
						КонецЕсли;
						НайденныеСтроки = Грузы.НайтиСтроки(Новый Структура("ДокументДоставки", Стр.ДокументДоставки));
						НПФактГрузы = 0;
						Если НайденныеСтроки.Количество() > 0 Тогда
							Для каждого Строка Из НайденныеСтроки Цикл
								
								НПФактГрузы = НПФактГрузы + Строка.НПФакт;
								
							КонецЦикла;
							
						КонецЕсли;
						
						Стр.НПФактНал = НПФактСписокГрузов + НПФактГрузы;
					КонецЕсли;
					ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаНаличными = Заказы.Итог("НПФактНал");
					ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаБезналичными = Заказы.Итог("НПФактБезнал");
					ЭтаФорма.ВладелецФормы.Объект.ИтогоРасходы = Заказы.Итог("Расходы");
					
					
				КонецЕсли;
				
				Если СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.Отказ") ИЛИ
					СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.НеДоставлен") Тогда
					Стр.Касса = "";
					Стр.Счет  = "";
					//ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаНаличными = 0;
					//ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаБезналичными = 0;
					
				Иначе
					Если ТипЗнч(Стр.ДокументДоставки) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
						Стр.Касса = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(ПредопределенноеЗначение("Перечисление.ES_ВидыСтартовыхНастроек.КассаНаложенныхПлатежей"));
						Стр.Счет  = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(ПредопределенноеЗначение("Перечисление.ES_ВидыСтартовыхНастроек.ДопКассаНП"));
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Стр.ДокументДоставки) = Тип("ДокументСсылка.ES_ЗаборГруза") И НЕ СтатусЗабораДляИзменения = Неопределено  Тогда
				Стр.СтатусЗаказа = СтатусЗабораДляИзменения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов.Отказ") Тогда
		// Очищаем факт суммы в ТЧ Места
		СписокГрузов = ЭтаФорма.ВладелецФормы.Объект.СписокГрузов;
		Если СписокГрузов.Количество() > 0 Тогда
			Для каждого Стр Из СписокГрузов Цикл
				Стр.НПФакт = 0;
			КонецЦикла; 
		КонецЕсли; 
		
		// Очищаем факт суммы в ТЧ Запасы
		Грузы = ЭтаФорма.ВладелецФормы.Объект.Грузы;
		Если Грузы.Количество() > 0 Тогда
			Для каждого Стр Из Грузы Цикл
				Стр.КоличествоФакт = 0;
				Стр.НПФакт = 0;
			КонецЦикла; 
		КонецЕсли;
	Иначе
		ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаНаличными = Заказы.Итог("НПФактНал")+ Заказы.Итог("СтоимостьФактНал");
		ЭтаФорма.ВладелецФормы.Объект.ES_ОплатаБезналичными = Заказы.Итог("НПФактБезнал") + Заказы.Итог("СтоимостьФактБезнал");
		ЭтаФорма.ВладелецФормы.Объект.ИтогоРасходы = Заказы.Итог("Расходы");
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
