
&НаСервере
Процедура ЗаписатьНаСервере()
	
	Константы.ES_ДельтаВремени.Установить(ДельтаВремени);
	Константы.ES_ОграничениеПоРасстоянию.Установить(ОграничениеПоРасстоянию);
	Константы.ES_ИнтервалВыбораЗаявок.Установить(ИнтервалВыбораЗаявок);
	Константы.ES_ВремяВозможноеДляЗадержкиТакси.Установить(ВремяДопустимогоОпозданияТакси);
	Константы.ES_ВремяВыполненияЗаказа.Установить(ВремяВыполненияЗаказа);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДельтаВремени					= Константы.ES_ДельтаВремени.Получить();
	ОграничениеПоРасстоянию			= Константы.ES_ОграничениеПоРасстоянию.Получить();
	ИнтервалВыбораЗаявок			= Константы.ES_ИнтервалВыбораЗаявок.Получить();
	ВремяДопустимогоОпозданияТакси	= Константы.ES_ВремяВозможноеДляЗадержкиТакси.Получить();
	ВремяВыполненияЗаказа			= Константы.ES_ВремяВыполненияЗаказа.Получить();
КонецПроцедуры