
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ответственный.Пустая() Тогда 
		Объект.Ответственный = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	////ES_Савченко Е.Р. 28.09.2017 +
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");	
	КонецЕсли;
	////ES_Савченко Е.Р. 28.09.2017 -

КонецПроцедуры


&НаКлиенте
Процедура ДопУслугиСтавкаНДСПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДопУслуги.ТекущиеДанные;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.Сумма*;
	
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДопУслугиСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ДопУслуги.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;  
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);  
	
КонецПроцедуры


&НаКлиенте
Процедура ДопУслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДопУслуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаКлиенте
Процедура ДопУслугиЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ДопУслуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДоступностиРасчширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		
		Если Результат = Истина Тогда
			ЗагрузитьФайл();
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл()
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораФайла.Фильтр = "(*.xls;*xlsx;*xlsb)| *.xls;*xlsx;*xlsb"; 
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = "Выберите файлы";
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляЗаписи", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляЗаписи(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда
		ОписаниеФайла = новый ОписаниеПередаваемогоФайла();
		ОписаниеФайла.Имя = ВыбранныеФайлы[0];
		ПомещаемыеФайлы = новый Массив;
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
		Расширение = Прав(ОписаниеФайла.Имя,СтрДлина(ОписаниеФайла.Имя)-Найти(ОписаниеФайла.Имя,"."));
		Структура = Новый Структура;
		Структура.Вставить("Расширение", Расширение); 
		Оповещение = новый ОписаниеОповещения("ОповещениеПомещениеФайла", ЭтотОбъект, Структура);		
		НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПомещениеФайла(ПомещенныеФайлы, ДопПараметры)Экспорт
	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив") Тогда
		
		мСтруктура = Новый Структура;
		мСтруктура.Вставить("ТабДок","");		
		ЗагрузитьExcelФайлВМассивЛистов(ПомещенныеФайлы[0].Хранение, ДопПараметры.Расширение, мСтруктура)
		
	КонецЕсли; 	
КонецПроцедуры 




&НаКлиенте
Процедура ЗагрузитьXLS(Команда)
	
	#Если ВебКлиент Тогда
		
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаДоступностиРасчширенияРаботыСФайлами", ЭтотОбъект);
		МенеджерОборудованияКлиент.ПроверитьДоступностьРасширенияРаботыСФайлами(ОписаниеОповещения, Истина);
		
	#Иначе
		
		ПутьКФайлу = "";
		АдресФайлаДанных= "";
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Фильтр = "(*.xls;*xlsx;*xlsb)| *.xls;*xlsx;*xlsb"; 
		Если ДиалогВыбораФайла.Выбрать() Тогда
			ПутьКФайлу = ДиалогВыбораФайла.ВыбранныеФайлы[0];
			Розширение = Прав(ПутьКФайлу,СтрДлина(ПутьКФайлу)-Найти(ПутьКФайлу,"."));
			АдресФайлаДанных = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
			
			//Мы помещаем объект формы в переменную,
			//так как должны передать её в процедуру на сервере,
			//где нельзя изменять объект формы, зато можно править переменную содержащую его
			//ЗагрузитьExcelФайлВМассивЛистов(АдресФайлаДанных);
			мСтруктура = Новый Структура;
			мСтруктура.Вставить("ТабДок","");
			ЗагрузитьExcelФайлВМассивЛистов(АдресФайлаДанных,Розширение,мСтруктура);
			//мСтруктура.ТабДок.Показать();
			
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры   

&НаСервере   
Процедура ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200)
	//EFSOL_Шаповал Олег Анатольевич 29 сентября 2017 г. 17:50:56 +
	Цена0 = Окр(элем.Вес1,0,РежимОкругления.Окр15как20);
	Цена05 = Окр(элем.Вес1,0,РежимОкругления.Окр15как20);				
	Цена1 = Окр(элем.Вес2,0,РежимОкругления.Окр15как20);
	Цена13 = Окр(элем.Вес3,0,РежимОкругления.Окр15как20);
	Цена3 = Окр(элем.Вес4,0,РежимОкругления.Окр15как20);
	Цена35 = Окр(элем.Вес5,0,РежимОкругления.Окр15как20);
	Цена5 = Окр(элем.Вес6,0,РежимОкругления.Окр15как20);
	Цена510 = Окр(элем.Вес7,0,РежимОкругления.Окр15как20);
	Цена10 = Окр(элем.Вес8,0,РежимОкругления.Окр15как20);
	Цена10200 = Окр(элем.Вес9,0,РежимОкругления.Окр15как20);
	Цена200 = Окр(элем.Вес10,0,РежимОкругления.Окр15как20); 
	

	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес0; 
	НоваяСтрокаТЧ.Цена = Цена0;  		
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес05; 
	НоваяСтрокаТЧ.Цена = Цена05; 		
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес1; 
	НоваяСтрокаТЧ.Цена = Цена1;   		
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес13; 
	НоваяСтрокаТЧ.Цена = Цена13;   		
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес3; 
	НоваяСтрокаТЧ.Цена = Цена3;   
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес35; 
	НоваяСтрокаТЧ.Цена = Цена35; 
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес5; 
	НоваяСтрокаТЧ.Цена = Цена5;  
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес510; 
	НоваяСтрокаТЧ.Цена = Цена510;  
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес10; 
	НоваяСтрокаТЧ.Цена = Цена10;  
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес10200; 
	НоваяСтрокаТЧ.Цена = Цена10200;   
	НоваяСтрокаТЧ = ТЧ.Добавить();
	НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	НоваяСтрокаТЧ.Вес =Вес200; 
	НоваяСтрокаТЧ.Цена = Цена200;
	//EFSOL Шаповал О.А. -	
КонецПроцедуры


&НаСервере   
Процедура ЗагрузитьExcelФайлВМассивЛистов(АдресФайлаДанных, Розширение, мСтруктура)
	 	
	мФайл = ПолучитьИзВременногоХранилища(АдресФайлаДанных);
	Имя = ПолучитьИмяВременногоФайла("."+Розширение);
	мФайл.Записать(Имя);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(Имя,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	КоличествоСтрок = 26;
	
	
	мСтруктура.ТабДок = ТабДок;
	//Возврат;	
	//Попытка
	//	
	//	//ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,4,2,13,12);
	//	//ТЗ2 = ПрочитатьТабличныйДокумент(,ТабДок,4,15,13,25);
	//	//ТЗ3 = ПрочитатьТабличныйДокумент(,ТабДок,4,28,13,38);
	//	//ТЗ4 = ПрочитатьТабличныйДокумент(,ТабДок,4,41,13,51);
	//	//ТЗ5 = ПрочитатьТабличныйДокумент(,ТабДок,4,54,13,64);
	//	//ТЗ6 = ПрочитатьТабличныйДокумент(,ТабДок,4,67,13,77);
	//	//ТЗ7 = ПрочитатьТабличныйДокумент(,ТабДок,4,80,13,90);
	//	//ТЗ8 = ПрочитатьТабличныйДокумент(,ТабДок,4,93,13,103); 		
	//	//
	//	//ТЗ9 = ПрочитатьТабличныйДокумент(,ТабДок,17,2,26,12);
	//	//ТЗ10 = ПрочитатьТабличныйДокумент(,ТабДок,17,15,26,25);
	//	//ТЗ11 = ПрочитатьТабличныйДокумент(,ТабДок,17,28,26,38);
	//	//ТЗ12 = ПрочитатьТабличныйДокумент(,ТабДок,17,41,26,51);
	//	//ТЗ13 = ПрочитатьТабличныйДокумент(,ТабДок,17,54,26,64);
	//	//ТЗ14 = ПрочитатьТабличныйДокумент(,ТабДок,17,67,26,77);
	//	//ТЗ15 = ПрочитатьТабличныйДокумент(,ТабДок,17,80,26,90);
	//	//ТЗ16 = ПрочитатьТабличныйДокумент(,ТабДок,17,93,26,103);
	//			
	//Исключение
	//	Сообщить("Неверная структура документа");
	//	Возврат;    
	//КонецПопытки;          

	Лист = 1;
	//ИмяЛиста = Лист.Name; 
	
	ТЧ=Объект.Цены;
	ТЧ.Очистить();
	Вес0     = Справочники.ES_Вес.НайтиПоНаименованию("0");
	Вес05    = Справочники.ES_Вес.НайтиПоНаименованию("0,5");
	Вес1     = Справочники.ES_Вес.НайтиПоНаименованию("1");
	Вес13    = Справочники.ES_Вес.НайтиПоНаименованию("(1+)");
	Вес3     = Справочники.ES_Вес.НайтиПоНаименованию("3");
	Вес35    = Справочники.ES_Вес.НайтиПоНаименованию("(3+)");
	Вес5     = Справочники.ES_Вес.НайтиПоНаименованию("5");
	Вес510   = Справочники.ES_Вес.НайтиПоНаименованию("(5+)");
	Вес10    = Справочники.ES_Вес.НайтиПоНаименованию("10");
	Вес10200 = Справочники.ES_Вес.НайтиПоНаименованию("(10+)");
	Вес200   = Справочники.ES_Вес.НайтиПоНаименованию("200");
	//Вес2001   = Справочники.ES_Вес.НайтиПоНаименованию("(200+)");
		
	// B2B + Экспресс + Д-Д
	Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,2,20,12);
		Исключение
			Сообщить("Неверная структура документа (B2B + Экспресс + Д-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе			
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);	 		
			КОнецЕсли;
		КонецЦикла;
	// B2B + Стандарт + Д-Д	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,2,34,12);
		Исключение
			Сообщить("Неверная структура документа (B2B + Стандарт + Д-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);		 		
			КОнецЕсли;
		КонецЦикла;
	// B2С + Экспресс + Т-Д	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,15,20,26);
		Исключение
			Сообщить("Неверная структура документа (B2С + Экспресс + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;
	// B2С + Стандарт + Т-Д	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,15,34,26);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;
	// B2В + Экспресс + Т-Д	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,28,20,38);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2В + Стандарт + Т-Д	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,28,34,38);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2В + Экспресс + Т-ПВЗ
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,41,20,51);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2В + Стандарт + Т-ПВЗ	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,41,34,51);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2С + Экспресс + Т-ПВЗ	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,54,20,64);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2С + Стандарт + Т-ПВЗ	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,54,34,64);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2С + Экспресс + Т-Т	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,11,67,20,77);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;

	// B2С + Стандарт + Т-Т	
	ИначеЕсли Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда  	
		Попытка
			ТЗ1 = ПрочитатьТабличныйДокумент(,ТабДок,25,67,34,77);
		Исключение
			Сообщить("Неверная структура документа (B2С + Стандарт + Т-Д)");
			Возврат;    
		КонецПопытки;
		Для Каждого элем ИЗ ТЗ1 Цикл   		 			
			ЗонаДоставки = элем.МРЗ;
			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
			Если ПустаяСтрока(ЗонаДоставки) тогда
				Сообщить("Зона доставки не найдена");
				Возврат;
			Иначе				
				ЗаполнитьСтрокуТЧ(ТЧ,элем,ЗонаДоставки,Вес0,Вес05,Вес1,Вес13,Вес3,Вес35,Вес5,Вес510,Вес10,Вес10200,Вес200);			 		
			КОнецЕсли;
		КонецЦикла;
	Иначе
		Сообщить("Неверная структура документа");
		
		
	КонецЕсли;
	//В2В + Экспресс + Т-Д 	
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Попытка
 //   		ТЗ2 = ПрочитатьТабличныйДокумент(,ТабДок,4,15,13,25);
 //   	Исключение
 //   		Сообщить("Неверная структура документа (В2В + Экспресс + Т-Д)");
 //   		Возврат;    
 //   	КонецПопытки;
 //   	Для Каждого элем ИЗ ТЗ2 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;  
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 		
 //   		КонецЕсли;
 //   	КонецЦикла; 
 //   КонецЕСли;
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Для Каждого элем ИЗ ТЗ3 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;   
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Для Каждого элем ИЗ ТЗ4 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //   
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 
 //   		КонецЕсли;   		
 //   		
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;     	
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ5 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ6 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ7 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ8 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;
 //   
 //   //Стандарт	
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда  	
 //   	Для Каждого элем ИЗ ТЗ9 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 

 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 		
 //   		КОнецЕсли;
 //   	КонецЦикла;
 //   КонецЕсли;
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Для Каждого элем ИЗ ТЗ10 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;  
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 

 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 		
 //   		КонецЕсли;
 //   	КонецЦикла; 
 //   КонецЕСли;
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Для Каждого элем ИЗ ТЗ11 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;   
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 // 
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
 //   	Для Каждого элем ИЗ ТЗ12 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //   
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 
 //   		КонецЕсли;   		
 //   		
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;     	
 //   
 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ13 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ14 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.СкладСклад И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ15 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 


 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;

 //   Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.Самовывоз И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2С Тогда
 //   	Для Каждого элем ИЗ ТЗ16 Цикл   		 			
 //   		ЗонаДоставки = элем.МРЗ;
 //   		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
 //   		Если ПустаяСтрока(ЗонаДоставки) тогда
 //   			Сообщить("Зона доставки не найдена");
 //   			Возврат;
 //   		Иначе
 //   			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
 //   			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
 //   			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
 //   			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
 //   			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
 //   			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
 //   			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
 //   			Цена510 = Окр(элем.V_5__,0,РежимОкругления.Окр15как20);
 //   			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
 //   			Цена10200 = Окр(элем.V_10__,0,РежимОкругления.Окр15как20);
 //   			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
 //
 //   			
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес0; 
 //   			НоваяСтрокаТЧ.Цена = Цена0;  		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес05; 
 //   			НоваяСтрокаТЧ.Цена = Цена05; 		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес1; 
 //   			НоваяСтрокаТЧ.Цена = Цена1;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес13; 
 //   			НоваяСтрокаТЧ.Цена = Цена13;   		
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес3; 
 //   			НоваяСтрокаТЧ.Цена = Цена3;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес35; 
 //   			НоваяСтрокаТЧ.Цена = Цена35; 
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес5; 
 //   			НоваяСтрокаТЧ.Цена = Цена5;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес510; 
 //   			НоваяСтрокаТЧ.Цена = Цена510;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10; 
 //   			НоваяСтрокаТЧ.Цена = Цена10;  
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес10200; 
 //   			НоваяСтрокаТЧ.Цена = Цена10200;   
 //   			НоваяСтрокаТЧ = ТЧ.Добавить();
 //   			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
 //   			НоваяСтрокаТЧ.Вес =Вес200; 
 //   			НоваяСтрокаТЧ.Цена = Цена200; 	
 //   		КонецЕсли;
 //   		
 //   	КонецЦикла; 
 //   КонецЕСли;


//	Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Сверхсрочная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериТерминал И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
//		Для Каждого элем ИЗ ТЗ9 Цикл   		 			
//			ЗонаДоставки = элем.МРЗ;
//			ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
//			Если ПустаяСтрока(ЗонаДоставки) тогда
//				Сообщить("Зона доставки не найдена");
//				Возврат;
//			Иначе
//				Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
//				Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
//				Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
//				Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
//				Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
//				Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
//				Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
//				Цена510 = Окр(элем.V5___,0,РежимОкругления.Окр15как20);
//				Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
//				Цена10200 = Окр(элем.V10___,0,РежимОкругления.Окр15как20);
//				Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20);    
//				
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес0; 
//				НоваяСтрокаТЧ.Цена = Цена0;  		
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес05; 
//				НоваяСтрокаТЧ.Цена = Цена05; 		
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес1; 
//				НоваяСтрокаТЧ.Цена = Цена1;   		
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес13; 
//				НоваяСтрокаТЧ.Цена = Цена13;   		
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес3; 
//				НоваяСтрокаТЧ.Цена = Цена3;   
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес35; 
//				НоваяСтрокаТЧ.Цена = Цена35; 
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес5; 
//				НоваяСтрокаТЧ.Цена = Цена5;  
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес510; 
//				НоваяСтрокаТЧ.Цена = Цена510;  
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес10; 
//				НоваяСтрокаТЧ.Цена = Цена10;  
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес10200; 
//				НоваяСтрокаТЧ.Цена = Цена10200;   
//				НоваяСтрокаТЧ = ТЧ.Добавить();
//				НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
//				НоваяСтрокаТЧ.Вес =Вес200; 
//				НоваяСтрокаТЧ.Цена = Цена200; 	
//			КонецЕсли;
//			
//		КонецЦикла; 
//	КонецЕСли;

	//Если Объект.Тариф = Перечисления.ES_СрочностьДоставки.Стандартная И Объект.ВидДоставки = Перечисления.ES_ВидыДоставки.ДвериТерминал И Объект.ВидКонтрагента = Перечисления.ES_ВидКонтрагента.В2В Тогда
	//	Для Каждого элем ИЗ ТЗ10 Цикл   		 			
	//		ЗонаДоставки = элем.МРЗ;
	//		ЗонаДоставки = Справочники.ES_ЗоныДоставки.НайтиПоНаименованию(ЗонаДоставки);
	//		Если ПустаяСтрока(ЗонаДоставки) тогда
	//			Сообщить("Зона доставки не найдена");
	//			Возврат;
	//		Иначе
	//			Цена0 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);
	//			Цена05 = Окр(элем.V0_5,0,РежимОкругления.Окр15как20);				
	//			Цена1 = Окр(элем.V1,0,РежимОкругления.Окр15как20);
	//			Цена13 = Окр(элем.V_1__,0,РежимОкругления.Окр15как20);
	//			Цена3 = Окр(элем.V3,0,РежимОкругления.Окр15как20);
	//			Цена35 = Окр(элем.V_3__,0,РежимОкругления.Окр15как20);
	//			Цена5 = Окр(элем.V5,0,РежимОкругления.Окр15как20);
	//			Цена510 = Окр(элем.V5___,0,РежимОкругления.Окр15как20);
	//			Цена10 = Окр(элем.V10,0,РежимОкругления.Окр15как20);
	//			Цена10200 = Окр(элем.V10___,0,РежимОкругления.Окр15как20);
	//			Цена200 = Окр(элем.V200,0,РежимОкругления.Окр15как20); 
	//			
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес0; 
	//			НоваяСтрокаТЧ.Цена = Цена0;  		
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес05; 
	//			НоваяСтрокаТЧ.Цена = Цена05; 		
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес1; 
	//			НоваяСтрокаТЧ.Цена = Цена1;   		
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес13; 
	//			НоваяСтрокаТЧ.Цена = Цена13;   		
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес3; 
	//			НоваяСтрокаТЧ.Цена = Цена3;   
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес35; 
	//			НоваяСтрокаТЧ.Цена = Цена35; 
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес5; 
	//			НоваяСтрокаТЧ.Цена = Цена5;  
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес510; 
	//			НоваяСтрокаТЧ.Цена = Цена510;  
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес10; 
	//			НоваяСтрокаТЧ.Цена = Цена10;  
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес10200; 
	//			НоваяСтрокаТЧ.Цена = Цена10200;   
	//			НоваяСтрокаТЧ = ТЧ.Добавить();
	//			НоваяСтрокаТЧ.ЗонаДоставки = ЗонаДоставки;
	//			НоваяСтрокаТЧ.Вес =Вес200; 
	//			НоваяСтрокаТЧ.Цена = Цена200; 	
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//КонецЕСли;

	
	//Книга.Close();   
//	Объект.Записать(); 
  	//Объект.Записать();                                                 
	//Эксель.Application.Quit();
КонецПроцедуры


Функция ПрочитатьТабличныйДокумент(ТЗ = Неопределено, ТабДок = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт
		
	Построитель = Новый ПостроительЗапроса;
	
	//Область = ТабДок.Область("R"+НомерПервойСтроки+"C"+НомерПервойКолонки+":R"+ВсегоСтрок+"C"+ВсегоКолонок);
	Область = ТабДок.Область(НомерПервойСтроки,НомерПервойКолонки,ВсегоСтрок,ВсегоКолонок);
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
    Построитель.Выполнить();
    ТЗ = Построитель.Результат.Выгрузить();
	Возврат ТЗ;

КонецФункции

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	ЗаказчикПриИзмененииНаСервере();   
		
КонецПроцедуры

&НаСервере
Процедура ЗаказчикПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Заказчик.ES_ВидКонтрагента) тогда
		Объект.ВидКонтрагента = Объект.Заказчик.ES_ВидКонтрагента;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ДопУслугиЦенаЗаКаждыйКгПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДопУслугиЦенаЗаКаждыйКгПриИзменении(Элемент)
	ДопУслугиЦенаЗаКаждыйКгПриИзмененииНаСервере();
	
	ТекДанные = Элементы.ДопУслуги.ТекущиеДанные;
	ИнтервальнаяУслуга = ES_ОбщегоНазначения.ЭР_ПолучитьЗначениеРеквизитаНаСервере(ТекДанные.Номенклатура,"ES_ИспользоватьИНтервалыВеса").ES_ИспользоватьИнтервалыВеса;
	
	Если НЕ ИнтервальнаяУслуга Тогда
		ТекДанные.ЦенаЗаКаждыйКг = 0;
		Сообщить("Для услуги "+ТекДанные.Номенклатура+" не указана возможность создания цены за каждый кг.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Заказчик) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Объект.Договор";
			Сообщение.Текст = "Договор не заполнен";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	УсловноеОформление.Элементы.Очистить();
	ЦветФона = Новый Цвет(204, 255, 204);
	СписокЗаказов = Новый СписокЗначений;
	Для каждого Стр ИЗ Объект.ДопУслуги Цикл
		Если Стр.Номенклатура.ES_Коэффициент  Тогда
			СписокЗаказов.Добавить(Стр.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДопУслуги.Номенклатура");
	ЭлементОтбора.ПравоеЗначение = СписокЗаказов;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	
	Оформление = ЭлементОформления.Поля.Элементы.Добавить();
	Оформление.Использование = Истина;
	Оформление.Поле = Новый ПолеКомпоновкиДанных("ДопУслугиЦена");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);	
	ЭлементОформления.Использование = Истина;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ДопУслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Если НЕ Объект.Договор.ES_УчетПриРасчетеЦенТК Тогда
		Сообщить("Для договора не установлен признак индивидуальных цен.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
