
&НаКлиенте
Процедура CTSM_ПриОткрытииПосле(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	//ЭтаФорма.Доступность = Ложь;
	
	// доработка для УТ и КА
	//Для каждого Элемент Из ЭтаФорма.Элементы Цикл
	//	Если Не Элемент.Имя = "Страницы" Тогда
	//		Попытка	
	//			Элемент.ТолькоПросмотр = Истина;
	//			Элемент.Доступность = Ложь;	
	//		Исключение
	//			//
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ЭтаФорма.Элементы.СтраницаДополнительныеРеквизиты.Доступность = Истина;
	//ЭтаФорма.Элементы.СтраницаДополнительныеРеквизиты.ТолькоПросмотр = Ложь;
	//
	//ЭтаФорма.КоманднаяПанель.Доступность = Истина;
	//ЭтаФорма.КоманднаяПанель.ТолькоПросмотр = Ложь;

КонецПроцедуры
