// Универсальные механизмы интеграции ИС (ЕГАИС, ГИСМ, ВЕТИС, ...)

#Область ПрограммныйИнтерфейс

#Область ФормыДокументовОснований

// Вызывается при возникновении события ОбработкаОповещения в форме документа-основания.
// В данной процедуре можно переопределить стандартную обработку этого события механизмом ВЕТИС.
// Если процедура переопределена, то необходимо установить параметр СобытиеОбработано в значение Истина.
//
Процедура ОбработкаОповещенияВФормеДокументаОснования(Форма, Объект, ИмяСобытия,
			Параметр, Источник, СобытиеОбработано) Экспорт
	
КонецПроцедуры

// Вызывается при возникновении события ОбработкаНавигационнойСсылки поля гиперссылки ВЕТИС в форме документа-основания.
// В данной процедуре можно переопределить стандартную обработку этого события механизмом ВЕТИС.
// Если процедура переопределена, то необходимо установить параметр СобытиеОбработано в значение Истина.
//
Процедура ОбработкаНавигационнойСсылкиВФормеДокументаОснования(Форма, Объект,
			Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, СобытиеОбработано) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Прочие

#КонецОбласти

// Обработчик команды "Разбить строку".
//
//	Параметры:
//		ТЧ - ДанныеФормыКоллекция
//		ЭлементФормы - ТаблицаФормы
//		ОповещениеПослеРазбиения - ОписаниеОповещения
//		ПараметрыРазбиенияСтроки - см. ОбщегоНазначенияУТКлиент.ПараметрыРазбиенияСтроки.
//
Процедура РазбитьСтрокуТабличнойЧасти(ТЧ, ЭлементФормы, ОповещениеПослеРазбиения = Неопределено, ПараметрыРазбиенияСтроки = Неопределено) Экспорт
	
	ИнтеграцияВЕТИСУНФКлиент.РазбитьСтрокуТЧ(ТЧ, ЭлементФормы, ОповещениеПослеРазбиения, ПараметрыРазбиенияСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// см ИнтеграцияВЕТИСКлиент.ДляУказанияСерийНуженСерверныйВызов
//
Функция ДляУказанияСерийНуженСерверныйВызов(Форма,
											ПараметрыУказанияСерий,
											Текст,
											СтандартнаяОбработка,
											ТекущиеДанные = Неопределено) Экспорт
	
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ВЕТИС

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
