// Русанова М. 11.03.2019 (

Процедура ОповеститьОНедоступности() Экспорт
	
	МасссивДанныхОНедоступности = CTSM_ПолучениеСведенийОНедоступностиСервер.ПолучитьДанныеОНедоступности();
	
	Если НЕ МасссивДанныхОНедоступности = Неопределено Тогда
		
		Для Каждого СтруктураСведенийОНедоступности Из МасссивДанныхОНедоступности Цикл
			
			Если (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности <= 1) Тогда
				ПрекратитьРаботуСистемы(Ложь);
			ИначеЕсли (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности <= 5) И (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности > 1) Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗавершенииСеанса", CTSM_ОбработкаОтветаНаВопросОЗавершенииРаботыВСлучаеНедоступности);
				ПоказатьВопрос(Оповещение, "До плановой недоступности сервиса осталось менее 5 минут: " + СтруктураСведенийОНедоступности.Ссылка + "."
				+ Символы.ПС + "Причина недоступности сервиса: " + СтруктураСведенийОНедоступности.ПричинаНедоступности + "."
				+ Символы.ПС + "Период недоступности сервиса: с " + СтруктураСведенийОНедоступности.ДатаНачалаАктуальности + " по " + СтруктураСведенийОНедоступности.ДатаОкончанияАктуальности + "."  
				+ Символы.ПС + "Просьба прервать работу с системой и завершить текущий сеанс. Завершить работу системы сейчас?", Режим);
				ПодключитьОбработчикОжидания("ОповеститьОНедоступности", 1*60, Истина); 
			ИначеЕсли (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности <= 15) И (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности > 5) Тогда
				ПоказатьПредупреждение(, "До плановой недоступности сервиса осталось менее 15 минут: " + СтруктураСведенийОНедоступности.Ссылка + "." 
				+ Символы.ПС + "Причина недоступности сервиса: " + СтруктураСведенийОНедоступности.ПричинаНедоступности + "." 
				+ Символы.ПС + "Период недоступности сервиса: с " + СтруктураСведенийОНедоступности.ДатаНачалаАктуальности + " по " + СтруктураСведенийОНедоступности.ДатаОкончанияАктуальности + "." ); 
				ПодключитьОбработчикОжидания("ОповеститьОНедоступности", 5*60, Истина);
			ИначеЕсли (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности <= 60) И (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности > 15) Тогда
				ПоказатьПредупреждение(,"Возможна плановая недоступность сервиса: " + СтруктураСведенийОНедоступности.Ссылка + "."
				+ Символы.ПС + "Причина недоступности сервиса: " + СтруктураСведенийОНедоступности.ПричинаНедоступности + "." 
				+ Символы.ПС + "Период недоступности сервиса: с " + СтруктураСведенийОНедоступности.ДатаНачалаАктуальности + " по " + СтруктураСведенийОНедоступности.ДатаОкончанияАктуальности + "." 
				+ Символы.ПС + "Просьба учесть это в своей работе.");
				ПодключитьОбработчикОжидания("ОповеститьОНедоступности", 15*60, Истина);
			ИначеЕсли (СтруктураСведенийОНедоступности.КоличествоМинутДоНедоступности > 60) Тогда
				ПоказатьПредупреждение(,"Возможна плановая недоступность сервиса: " + СтруктураСведенийОНедоступности.Ссылка + "."
				+ Символы.ПС + "Причина недоступности сервиса: " + СтруктураСведенийОНедоступности.ПричинаНедоступности + "." 
				+ Символы.ПС + "Период недоступности сервиса: с " + СтруктураСведенийОНедоступности.ДатаНачалаАктуальности + " по " + СтруктураСведенийОНедоступности.ДатаОкончанияАктуальности + "." 
				+ Символы.ПС + "Просьба учесть это в своей работе.");
				ПодключитьОбработчикОжидания("ОповеститьОНедоступности", 60*60, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ПодключитьОбработчикОжидания("ОповеститьОНедоступности",15*60, Истина);
		
	КонецЕсли;
	
КонецПроцедуры


// Русанова М. 11.03.2019 )