#Область ПрограммныйИнтерфейс

Функция ВидыПодключаемыхКоманд() Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

#Область КомандыДокументовВЕТИС

Процедура КомандыИсходящейТранспортнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"РасходнаяНакладная",	НСтр("ru = 'Расходную накладную'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПеремещениеЗапасов",	НСтр("ru = 'Перемещение запасов'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ЗаказПокупателя",		НСтр("ru = 'Заказ-наряд'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ОтчетОПереработке",		НСтр("ru = 'Отчет о переработке'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РасходнаяНакладная",	НСтр("ru = 'Расходную накладную'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеЗапасов",	НСтр("ru = 'Перемещение запасов'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ЗаказПокупателя",		НСтр("ru = 'Заказ-наряд'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОтчетОПереработке",		НСтр("ru = 'Отчет о переработке'"));
	
КонецПроцедуры

Процедура КомандыВходящейТранспортнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПриходнаяНакладная",	НСтр("ru = 'Приходную накладную'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПеремещениеЗапасов",	НСтр("ru = 'Перемещение запасов'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПриходнаяНакладная",	НСтр("ru = 'Приходную накладную'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеЗапасов",	НСтр("ru = 'Перемещение запасов'"));
	
КонецПроцедуры

Процедура КомандыПроизводственнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды, "СборкаЗапасов",         НСтр("ru = 'Производство'"), "ИспользоватьПодсистемуПроизводство");
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СборкаЗапасов",         НСтр("ru = 'Производство'"), "ИспользоватьПодсистемуПроизводство");
	
КонецПроцедуры

Процедура КомандыИнвентаризацииПродукции(Команды) Экспорт
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"СписаниеЗапасов",			НСтр("ru = 'Списание запасов'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ОприходованиеЗапасов",	НСтр("ru = 'Оприходование запасов'"));
	
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"СписаниеЗапасов",			НСтр("ru = 'Списание запасов'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РаспределениеЗатрат",		НСтр("ru = 'Распределение затрат'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОприходованиеЗапасов",		НСтр("ru = 'Оприходование запасов'"));
	ПодключаемыеКомандыВЕТИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПересортицаЗапасов",		НСтр("ru = 'Пересортицу запасов'"));
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВидимостьюКомандВЕТИС

Процедура УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, КомандыОбъекта) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
		
	ОднаОрганизация = (Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований = Форма.ГрузополучательСопоставлениеХСДляОтбораОснований)
		И ЗначениеЗаполнено(Форма.ГрузоотправительСопоставлениеХСДляОтбораОснований);
		
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл
		
		Если КлючИЗначение.Значение.ИмяМетаданных = "ПеремещениеЗапасов" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ОднаОрганизация;
		Иначе 
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ОднаОрганизация;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандВходящейТранспортнойОперации(Форма, КомандыОбъекта) Экспорт
	
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл
		Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандПроизводственнойОперации(Форма, КомандыОбъекта) Экспорт
	
	Для Каждого Команда Из Форма.ВидимостьПодключаемыхКоманд Цикл 
		Форма.Элементы[Команда.Ключ].Видимость = НЕ ЗначениеЗаполнено(Форма.Объект.ДокументОснование);
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, КомандыОбъекта) Экспорт
	
	ЕстьРасход = Ложь;
	ЕстьПриход = Ложь;
	Для Каждого СтрокаТЧ Из Форма.Объект.Товары Цикл
		Если СтрокаТЧ.КоличествоИзменениеВЕТИС<0 Тогда 
			ЕстьРасход = Истина;
		ИначеЕсли СтрокаТЧ.КоличествоИзменениеВЕТИС>0 Тогда 
			ЕстьПриход = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Форма.ВидимостьПодключаемыхКоманд Цикл 
		Если КлючИЗначение.Значение.ИмяМетаданных = "ПересортицаЗапасов" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = ЕстьПриход = ЕстьРасход;
		ИначеЕсли КлючИЗначение.Значение.ИмяМетаданных = "ОприходованиеЗапасов" Тогда
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьРасход;
		Иначе
			Форма.Элементы[КлючИЗначение.Ключ].Видимость = НЕ ЕстьПриход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

