
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = Параметры.Сообщение;
	Если Сообщение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = Сообщение.Описание;
	
	ТекстСообщенияXML = ИнтеграцияГосИС.ФорматироватьXMLСПараметрами(
			Сообщение.ТекстСообщенияXML,
			ИнтеграцияГосИС.ПараметрыФорматированияXML(Истина));
	
	ТабличныйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
	
КонецПроцедуры

#КонецОбласти