// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъектРеквизит = РеквизитФормыВЗначение("Объект");
	ИмяМакета = ?(Параметры.RICOH, "СправкаRicoh", "Справка");
	Макет = ЭтотОбъектРеквизит.ПолучитьМакет(ИмяМакета); 
	СоглашениеОРазрешенииРаботыССервисом = Макет.ПолучитьТекст();

КонецПроцедуры


// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
