// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ESDLФИОПользователя = ЭтаФорма.Параметры.ESDLФИОПользователя;
	ESDLEmailПользователя = ЭтаФорма.Параметры.ESDLEmailПользователя;
	ESDLPhoneNumberПользователя = ЭтаФорма.Параметры.ESDLPhoneNumberПользователя;
		
	КоличествоСтраницЛицензии = Параметры.КоличествоСтраницЛицензии;
	КоличествоДнейЛицензии = Параметры.КоличествоДнейЛицензии;
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить("Лицензия действительна ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + КоличествоДнейЛицензии, Новый Шрифт(,12), Новый Цвет(0, 0, 139)));
	МассивСтрок.Добавить(" дней. Осталось ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("" + КоличествоСтраницЛицензии, Новый Шрифт(,12), Новый Цвет(0, 0, 139)));
	МассивСтрок.Добавить(" страниц лицензии.");
	Элементы.Лицензия.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок); 
	//ПараметрыДляПередачи = Новый Структура("ESDLИДАккаунта, ESDLИДПользователя, ESDLТокен, ESDLФИОПользователя, ESDLEmailПользователя, ESDLPhoneNumberПользователя, КоличествоДнейЛицензии, КоличествоСтраницЛицензии");
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриОткрытии"
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ЛК.Видимость = НЕ ВладелецФормы.RICOH;

	Если ВладелецФормы.ProtectedMode Тогда
		Элементы.Лицензия.Заголовок = "Информация о доступности ресурсов пользователя временно недоступна"; 	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события элемента ЛК "Нажатие"
//
&НаКлиенте
Процедура ЛКНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПустойОбработчикОповещения", ВладелецФормы);
	НачатьЗапускПриложения(ОписаниеОповещения, "https://cp.42clouds.com"); 

КонецПроцедуры



// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
