&НаКлиенте
Перем КонтрагентСсылка;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КраткоеНаименование = Параметры.КраткоеНаименование;
	ПолноеНаименование = Параметры.ПолноеНаименование;
	ИНН = Параметры.ИНН;
	КПП = Параметры.КПП;
	АдресКонтрагента = Параметры.АдресКонтрагента;
	ТелефонКонтрагента = Параметры.ТелефонКонтрагента;
	Родитель = Параметры.Родитель;
	ВалютаВзаиморасчетов = Параметры.ВалютаВзаиморасчетов;
	ВидДокумента = Параметры.ВидДокумента;
	ТекДокИД = Параметры.ТекДокИД;
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ДанныеКонтрагента = Новый Структура("КраткоеНаименование, ПолноеНаименование, ИНН, КПП, АдресКонтрагента, АдресПартнера, ВидДокумента, ТелефонКонтрагента, Родитель, ВалютаВзаиморасчетов, КонтрагентСсылка, ТекДокИД",
	КраткоеНаименование, ПолноеНаименование, ИНН, КПП, АдресКонтрагента, АдресКонтрагента, ВидДокумента, "", Родитель, ВалютаВзаиморасчетов, КонтрагентСсылка, ТекДокИД);
	Сообщение = "";
	КонтрагентСсылка = ВладелецФормы.СоздатьКонтрагентаВызовСервера(ДанныеКонтрагента, Сообщение);
	
	Если Сообщение <> "" Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = Сообщение;
		СообщениеПользователю.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		СообщениеПользователю.Сообщить();
		Возврат;
	Иначе
		Если НЕ (КонтрагентСсылка = Неопределено ИЛИ КонтрагентСсылка.Пустая()) Тогда
			ДанныеКонтрагента.КонтрагентСсылка = КонтрагентСсылка;
			Оповестить("ВыбранКонтрагент", ДанныеКонтрагента);
			ПараметрыОткрытияФормы = Новый Структура("Ключ", КонтрагентСсылка);
			ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыОткрытияФормы);
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ДанныеКонтрагента = Новый Структура("КраткоеНаименование, ПолноеНаименование, ИНН, КПП, АдресКонтрагента, ТелефонКонтрагента, Родитель, ВалютаВзаиморасчетов, ТекДокИД",
		КраткоеНаименование, ПолноеНаименование, ИНН, КПП, АдресКонтрагента, "", Родитель, ВалютаВзаиморасчетов, ТекДокИД);
			
	Оповестить("ИзмененыДанныеКонтрагента", ДанныеКонтрагента);
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры

