

//отправляет в чат сообщение от бота
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ИспользоватьПрокси	= Истина;
	ТокенБота 			= ПолеДляТокена;
	
	ИспользоватьПрокси	= Истина;
	ПроксиСервер		= "socks5://s6.esit.info";
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows); 
	
	ИнтернетПрокси = Новый ИнтернетПрокси;
	ИнтернетПрокси.Установить("https", ПроксиСервер, 31080, "Delans", "Delans_2019");
	
	Попытка
		
		Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());
		
		ПолучениеЗапрос = "bot"+ТокенБота+"/getUpdates";
		Запрос = Новый HTTPЗапрос(ПолучениеЗапрос);
		Ответ = Соединение.Получить(Запрос);
		
		Результат = ПрочитатьОтветJSON(Ответ.ПолучитьТелоКакСтроку());
		
		МассивСообщений = Результат.result;
		Для каждого СтруктураСообщения из МассивСообщений Цикл
			Отправитель = ""+СтруктураСообщения.message.from.first_name+" "+СтруктураСообщения.message.from.last_name;
			ИДЧата = Формат(СтруктураСообщения.message.chat.id, "ЧГ=");
			
			Сообщить(СтрШаблон("Отправитель: %1; ID чата: %2", Отправитель, ИДЧата));
		КонецЦикла;
		ПроизвольныйТекст = "Тест";
		Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());
		ПолучениеЗапрос = "bot"+ТокенБота+"/sendMessage?chat_id="+ИДЧата+"&text="+ПроизвольныйТекст;
		Запрос = Новый HTTPЗапрос(ПолучениеЗапрос);
		НОтвет = Соединение.Получить(Запрос);
		
		Результат = ПрочитатьОтветJSON(НОтвет.ПолучитьТелоКакСтроку());
		
	Исключение
		Сообщить("Ошибка подключения к серверу Telegram!", СтатусСообщения.ОченьВажное);
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Соединение = Неопределено;
	КонецПопытки;
	
	//Возврат Соединение;
КонецПроцедуры

&НаСервере
Функция ПрочитатьОтветJSON(Ответ)
	
	Возврат ES_ТелеграмAPI.ПрочитатьОтветJSON(Ответ);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьТелеграм(Команда)
	ПерейтиПоНавигационнойСсылке("https://web.telegram.org/");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитНачало = "У вас есть аккаунт телеграм?";
	//ТекстовоеСозданиеАккаунта = "Теперь нужно создать аккаунт в телеграм, для этого:";
	ТекстовоеСозданиеАккаунтаШаг1 = "1) Нажать кнопку ""открыть телеграм"", и сайт откроется в вашем браузере, если браузер выдал ошибку, тогда нужно включить VPN и обновить страницу(или скачайте на свое мобильное устройство приложение и откройте его)";
	ТекстовоеСозданиеАккаунтаШаг2 = "2) Нужно зерегистрирогватся, в доступных полях выбрать страну проживания, и ввести свой номер телефона, и нажать ""Next""";
	ТекстовоеСозданиеАккаунтаШаг3 = "3) Дальше на Ваш номер телефона придет СМС с кодом для регистрации, его нужно ввести в доступное поле";
	ТекстовоеСозданиеАккаунтаШаг4 = "4) Если Вы выполнили все действия правильно, теперь Вам откроется интерфейс Вашего мессенджера";
	ТекстовоеСозданиеАккаунтаШаг5 = "5) Теперь нам нужно создать бота телеграм, для этого перейдите на следуйщий этап";
	ТекстовоеДляВхода = "Перед тем как начать создавать бота в телеграм, нужно войти в свой аккаунт, для этого нажмите кнопку ""Открыть телеграм"", если браузер выдал ошибку, тогда нужно включить VPN и обновить страницу, и введите свои учетные данные или войдите в акккаунт на своем мобильном устройстве и перейдите на седуйщий этап";
	//ТекстовоеДляСозданиеБота = "Для того, что бы, созать телеграм бота нужно:";
	ТекстовоеДляСозданиеБотаШаг1 = "1) в строке поиска найти и добавить в свои контакты ""BotFather""";
	ТекстовоеДляСозданиеБотаШаг2 = "2) отправить ему сообщение ""/start"", он отправит Вам список доступных команд";
	ТекстовоеДляСозданиеБотаШаг3 = "3) Дальше отправляем ""/newbot"", теперь он предложит Вам назвать своего бота, тогда введите любое имя для Вашего бота";
	ТекстовоеДляСозданиеБотаШаг4 = "4) После того, как вы назвали бота, Вам нужно вписать username вашего бота, оно обязательно должно заканчиваться на ""bot"", например: TetrisBot или tetris_bot. Если такое имя уже есть, тогда  бот предложит выбрать другое имя, иначе вам придет сообщение с Токеном созданого бота";
	ТекстовоеДляСозданиеБотаШаг5 = "5) Ваш бот создан, теперь сохраните токен Вашего бота (он выглядит так 1111111111:АААаааАААааАаа3АаАа4ААаА), заполните поле ""Токен бота""и нажмите ""записать в регистр""";
	ТекстовоеДляСозданиеБотаШаг6 = "6) Перед тем как проверять подключение к вашему боту добавте его в свои контакты и отправте ему команду ""/start""";
	ТекстовоеДляСозданиеБотаШаг7 = "7) Теперь проверяем правильно ли все сделано, нажмите ""проверить подключение"", ваш бот должен отправить вам в чат сообщение";
	ПолеДляТокена = "1111111111:АААаааАААааАаа3АаАа4ААаА";
	ТекстовоеДляВебхука = "   Дальше нам нужно будет подключить вебхук для вашего бота, для этого переходим на следуйщий этап";
	ТекстовоеВебхукПодкл = "   Если бот отправил Вам сообщение, значит осталось только подключить вашего бота к вебхуку, то есть задать ему адрес в сети, что бы он отвечал на ваши команды, для этого:" + Символы.ПС +
	"   Нужно заполнить поле ""Адрес базы в сети"" по представленому примеру, и нажать кнопку ""Подключить вебхук""" + Символы.ПС +
	"   Если Вам программа сообщила ""webhook was set"" значит вебхук подключен и теперь ваш бот знает несколько команд, таких как:" + Символы.ПС + Символы.ПС +
	"/start"+ Символы.ПС + Символы.ПС +
	"/help" + Символы.ПС + Символы.ПС +
	"/settings";
	АдресБазыВСети = "https://d7.efsol.ru:443/KorpDostavkaTelegram/hs/Forbot1c/getMessage";
	ДляСправки = "   Если все действия выполнены правильно, значит теперь вы можете отправлять в телеграм планы доставки и сборы грузов, для этого у вас есть кнопки в формах списка соответствующих документов, нужно выбрать документы которые вы хотите отправить и нажать кнопку ""Отправить в телеграм""." + Символы.ПС + 
	"   Для того чтобы сообщения приходили в нужный чат, создайте групу для общения в телеграмм, добавте туда вашего бота и напишите ему команду ""/start"", бот ответит на это сообщением с кнопкой, тоесть теперь он все сообщения будет отправлять именно в этот чат, косая линия в начале сообщения означает, что вы обращаетесь именно к боту, если вы отправите не правильную команду, то бот попросит ввести корректную команду." + Символы.ПС +
	"   Примечание: бот будет писать именно в тот чат с которого ему в ближайшее время отправили команду ""/start"", так как он сохраняет последний чат с этим сообщением. Остальные команды, которые знает бот, такие как ""/settings"" и ""/help"", существуют для того, чтобы посмотреть все доступные боту команды и узнать, что может ваш бот, эти команды как дополнение, они не обзязательны, но их должен знать каждый бот телеграм." + Символы.ПС +
	"   Перед тем как отправлять планы доставки и сборы грузов нужно в стартовых настройках задать значения токена бота, которого вы создали, и, нужно создать шаблоны сообщения для ваших документов в справочнике ""Шаблоны сообщений"" и, так же, задать их в стартовых настройках. Для создания шаблона сообщения вам нужно выбрать назначение ""Заказ покупателя"" и выбрать нужные поля для заполнения вашего сообщения."
	
	
КонецПроцедуры

&НаСервере
Процедура НеактивнаяВкладка()
	
	Элементы.СозданиеАккаунта.Доступность = Ложь;	 
	
КонецПроцедуры

&НаСервере
Процедура ДаНаСервере()	
	Элементы.Группа1.ТекущаяСтраница.Доступность = Истина;		
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница2;
	Элементы.Группа1.ТекущаяСтраница = Элементы.ВойдитеВТелеграм;
	ДаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	Элементы.Группа1.ТекущаяСтраница = Элементы.СозданиеАккаунта;
	ДаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СледующийЭтап(Команда)
	Элементы.Группа1.ТекущаяСтраница = Элементы.СозданиеБота;
	ДаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаключительныйЭтап(Команда)
	Элементы.Группа1.ТекущаяСтраница = Элементы.ПодключениеВебхука;
	ДаНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПодключитьВебхук(Команда)
	
	ИспользоватьПрокси	= Истина;
	ТокенБота 			= ПолеДляТокена;
	АдресБазы 			= АдресБазыВСети;
	
	ИспользоватьПрокси	= Истина;
	ПроксиСервер		= "socks5://s6.esit.info";
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows, Новый СертификатыУдостоверяющихЦентровWindows); 
	
	ИнтернетПрокси = Новый ИнтернетПрокси;
	ИнтернетПрокси.Установить("https", ПроксиСервер, 31080, "Delans", "Delans_2019");
	
	
	Ресурс = "bot"+ТокенБота+"/setWebhook?url="+АдресБазы;  
	Попытка	
		Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());
		Запрос = Новый HTTPЗапрос(Ресурс);
		Запрос.Заголовки.Вставить("Connection", "keep-alive");
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Ошибка  = Истина;
		ТекстОтвета = ОписаниеОшибки();
	КонецПопытки;
	
	Результат = ПрочитатьОтветJSON(Ответ.ПолучитьТелоКакСтроку());
	
	//НастройкиСериализации = Новый НастройкиСериализацииJSON;
	//НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	//НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	//НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	//ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	//ЗаписьJSON = Новый ЗаписьJSON;
	//СтруктураВыгрузки = Новый Структура;
	//СтруктураВыгрузки.Вставить("result",Результат);
	//ЗаписьJSON.ПроверятьСтруктуру = Истина;
	//ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	//ЗаписатьJSON(ЗаписьJSON, СтруктураВыгрузки, НастройкиСериализации);
	//СтрокаJSON = ЗаписьJSON.Закрыть();
	//Сообщить(Результат.description);
	
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ЗаписатьВРегистрНаСервере() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ES_ТаблицаТокенов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Токен = ПолеДляТокена;
	МенеджерЗаписи.Записать(Истина);
	Сообщить("Токен сохранен");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)
	ЗаписатьВРегистрНаСервере();
КонецПроцедуры
//не используется
&НаСервере
Процедура ПолучитьЗаписьРегистраНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Расш1_ДляБота.ТокенБота) КАК Токен
	|ИЗ
	|	РегистрСведений.Расш1_ДляБота КАК Расш1_ДляБота";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТокенБота = Выборка.Токен;
	КонецЦикла;
	
КонецПроцедуры
//не используется
&НаКлиенте
Процедура ПолучитьЗаписьРегистра(Команда)
	ПолучитьЗаписьРегистраНаСервере();
КонецПроцедуры
	
	
	
	  
	

