
&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьСервер(КлючДоступа);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКлюч(Команда)
	//EFSOL Шаповал О.А. 03.08.2018 16:49:35 {
	ПерейтиПоНавигационнойСсылке("https://pushnotifications.1c.com/push/publishers/new");
	//}EFSOL Шаповал О.А.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСервер(КлючДоступа)
	Константы.ES_КлючДоступа.Установить(КлючДоступа);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлючДоступа = Константы.ES_КлючДоступа.Получить();
КонецПроцедуры
