
//&Вместо("ПолучитьПланыОбменаКонфигурации")
//Функция CTSM_ПолучитьПланыОбменаКонфигурации()
//	
//	//+++
//	CTSM_ФабрикаXDTO = CTSM_Efsol_Платформа.CTSM_ФабрикаXDTO("http://www.1c.ru/SaaS/ExchangeAdministration/Common", "ExchangeFeature"); 
//	Если CTSM_ФабрикаXDTO = Неопределено Тогда
//		ВызватьИсключение(НСтр("ru = 'Ошибка получения пакета XDTO ExchangeFeatures'"));
//	КонецЕсли;
//	//---  и далее CTSM_ФабрикаXDTO вместо ФабрикаXDTO

//	
//	Результат = CTSM_ФабрикаXDTO.Создать(CTSM_ФабрикаXDTO.Тип("http://www.1c.ru/SaaS/ExchangeAdministration/Common", "ExchangeFeatures"));
//	ТипExchangeFeature = CTSM_ФабрикаXDTO.Тип("http://www.1c.ru/SaaS/ExchangeAdministration/Common", "ExchangeFeature");
//	
//	Для Каждого ИмяПланаОбмена Из ОбменДаннымиВМоделиСервисаПовтИсп.ПланыОбменаСинхронизацииДанных() Цикл
//		
//		ExchangeFeature = CTSM_ФабрикаXDTO.Создать(ТипExchangeFeature);
//		ExchangeFeature.ExchangePlan = ИмяПланаОбмена;
//		
//		ВерсияБСП243 = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СтандартныеПодсистемыСервер.ВерсияБиблиотеки(), "2.4.3.1") >= 0;
//		
//		ExchangeFeature.ExchangeRole = ?(ВерсияБСП243,
//			ОбменДаннымиСервер.ЗначениеНастройкиПланаОбмена(ИмяПланаОбмена,"ИмяКонфигурацииИсточника"),
//			ПланыОбмена[ИмяПланаОбмена].ИмяКонфигурацииИсточника());
//			
//		ExchangeFeature.ExchangeRole = СокрЛП(ExchangeFeature.ExchangeRole);
//		
//		Если ПустаяСтрока(ExchangeFeature.ExchangeRole) Тогда
//			Если ВерсияБСП243 Тогда
//				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не задано возвращаемое значение функции ИмяКонфигурацииИсточника() в модуле менеджера плана обмена %1'"),
//					ИмяПланаОбмена);
//			Иначе
//				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не задано значение свойства ИмяКонфигурацииИсточника в процедуре ПриПолученииНастроек() модуля менеджера плана обмена %1'"),
//					ИмяПланаОбмена);
//			КонецЕсли;
//		КонецЕсли;
//		
//		Результат.Feature.Добавить(ExchangeFeature);
//		
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции
