&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(Отказ, Ссылка, Город1,Город2)
    Запрос    = Новый Запрос("ВЫБРАТЬ
                             |	ES_Направления.Ссылка
                             |ИЗ
                             |	Справочник.ES_Направления КАК ES_Направления
                             |ГДЕ
                             |	ES_Направления.Город1 = &Город1
                             |	И ES_Направления.Город2 = &Город2
                             |	И НЕ ES_Направления.Ссылка = &Ссылка");
	
    Запрос.УстановитьПараметр("Город1", Город1);
	Запрос.УстановитьПараметр("Город2", Город2);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Отказ    = НЕ Запрос.Выполнить().Пустой();
	//Если РезультатЗапроса.Пустой() Тогда
	//    Возврат Ложь;
	//КонецЕсли;
	//Возврат Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ПередЗаписьюНаСервере(Отказ, Объект.Ссылка, Объект.Город1, Объект.Город2);
    Если Отказ Тогда
        Сообщить("Данное направление уже существует");
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Город1ПриИзменении(Элемент)  
	СформироватьНаименование(); 	
КонецПроцедуры


&НаКлиенте
Процедура Город2ПриИзменении(Элемент) 	
	СформироватьНаименование(); 	
КонецПроцедуры

&Наклиенте
Процедура СформироватьНаименование()  	
	
	Объект.Наименование = СокрЛП(Объект.Город1)+"+"+СокрЛП(Объект.Город2);  	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.
КонецПроцедуры


