
Функция GetDeliveryReport (Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИдентификаторУстройства = Запрос.ПараметрыЗапроса.Получить("id");
	
	СтруктураОтвета = ES_Mobile.ПолучитьКурьераПоУстройству(ИдентификаторУстройства);
	
	Если СтруктураОтвета.Ок = Ложь Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвета.Сообщение);
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		Ответ = ES_Mobile.ПолучитьОтчетНаСегодня(СтруктураОтвета.Курьер);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция SendDeliveryReportPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИдентификаторУстройства = Запрос.ПараметрыЗапроса.Получить("id");
	
	СтруктураОтвета = ES_Mobile.ПолучитьКурьераПоУстройству(ИдентификаторУстройства);
	
	Если СтруктураОтвета.Ок = Ложь Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвета.Сообщение);
		Возврат Ответ;
	КонецЕсли;
	
	//СтрокаJSON = Запрос.ПараметрыЗапроса.Получить("data");
	//Если СтрокаJSON = Неопределено Тогда
	//	Возврат Ответ;
	//КонецЕсли;
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
	
		Ответ = ES_Mobile.ЗаполнитьОтчетДаннымиСМобильного(СтрокаJSON, СтруктураОтвета.Курьер);
	
	Исключение
	    Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());

	КонецПопытки;

	
	Возврат Ответ;
КонецФункции

Функция GetPushIDGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИдентификаторУстройства = Запрос.ПараметрыЗапроса.Получить("id");
	ТекстЗапрос = Запрос.ПараметрыЗапроса.Получить("reginfo");
	//ТекстЗапрос = Запрос.ПолучитьТелоКакСтроку();
	
	//EFSOL_Сальник К.А. 2019-05-15 {+
	СтруктураОтвета = ES_Mobile.УстановитьIDУстройстваДляКурьера(ИдентификаторУстройства,ТекстЗапрос);
	ОбработкаJSON = Обработки.JSON_and_UnJSON.Создать();
	ТелоЗапроса =  ОбработкаJSON.JSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоЗапроса);
	//EFSOL_Сальник К.А.  -}
	
	Если СтруктураОтвета.Ок = Ложь Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(ТелоЗапроса);
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция get_courier_coordinatesGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИдентификаторУстройства = Запрос.ПараметрыЗапроса.Получить("id");
	КоординатыПолучены = Запрос.ПараметрыЗапроса.Получить("success");
	Долгота = Запрос.ПараметрыЗапроса.Получить("long");
	Широта = Запрос.ПараметрыЗапроса.Получить("lat");
	Адрес = Запрос.ПараметрыЗапроса.Получить("address");
	
	
	СтруктураОтвета = ES_Mobile.ПолучитьКурьераПоУстройству(ИдентификаторУстройства);
	
	Если СтруктураОтвета.Ок = Ложь Тогда
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвета.Сообщение);
		Возврат Ответ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Долгота) Тогда
		ES_Mobile.ЗаписатьДанныеМестонахожденияКурьера(СтруктураОтвета.Курьер,Долгота,Широта,Адрес);
	КонецЕсли;
	
	
	Возврат Ответ;
КонецФункции

Функция SendGoogleDriveTokenPOST(Запрос)
	//EFSOL_Сальник К.А. 2019-05-08 {+
	
	Ответ = Новый HTTPСервисОтвет(200);	
	
	ДокументДоставкиИД = Запрос.ПараметрыЗапроса.Получить("id");
	
	Попытка
		Ответ = ES_Mobile.ПолучитьТокенДоступаGoogleDrive(ДокументДоставкиИД);
	Исключение
	    Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
	//EFSOL_Сальник К.А.  -}
	
КонецФункции
