&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаСортировки.Загрузить(Параметры.ТаблицаСортировки.Выгрузить());
	ТаблицаОтборов.Загрузить(Параметры.ТаблицаОтборов.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	СтруктураОповещения = Новый Структура("ТаблицаСортировки", ТаблицаСортировки);
	Если ИзменилисьОтборы Тогда
		СтруктураОповещения.Вставить("ТаблицаОтборов", ТаблицаОтборов);
	КонецЕсли;
	ОповеститьОВыборе(СтруктураОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ОповеститьОВыборе(Неопределено);
	
КонецПроцедуры

// Процедура - обработчик события формы "ОбработкаОповещения"
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УпрОсновнаяФормаБудетЗакрыта"  И ЭтаФорма.Открыта() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборовВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ТаблицаОтборовВидСравнения.СписокВыбора.Очистить();
	Для Каждого ЭлСписка Из Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийВидСравнения Цикл
		Элементы.ТаблицаОтборовВидСравнения.СписокВыбора.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборовЗначениеОтбораОчистка(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора) = Тип("Дата") Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора = НачалоГода(ТекущаяДата());
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним = Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора;
		Элементы.ТаблицаОтборов.ТекущиеДанные.Использование = Ложь;
	ИначеЕсли Элементы.ТаблицаОтборов.ТекущиеДанные.ИмяПоля = "ИнтервалДат" Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора = "3";
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним = Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора.НайтиПоЗначению("3").Представление; ;
	Иначе
		Элементы.ТаблицаОтборов.ТекущиеДанные.Использование = Ложь;
	КонецЕсли; 
	ОбновитьОтображениеДанных();
	ИзменилисьОтборы = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборовЗначениеОтбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Если Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора <> ВыбранноеЗначение Тогда
		Если Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора.Количество() > 0 Тогда
			Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним = Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора.НайтиПоЗначению(ВыбранноеЗначение).Представление; 
			Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора = ВыбранноеЗначение;
		Иначе
			Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним = ВыбранноеЗначение;
		КонецЕсли;
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора = ВыбранноеЗначение;
		Элементы.ТаблицаОтборов.ТекущиеДанные.Использование = Истина;
		ИзменилисьОтборы = Истина;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборовПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаОтборовЗначениеОтбораСиноним" Тогда
		Элементы.ТаблицаОтборовЗначениеОтбораСиноним.СписокВыбора.Очистить();
		Если Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора.Количество() > 0 Тогда
			Элементы.ТаблицаОтборовЗначениеОтбораСиноним.КнопкаВыпадающегоСписка = Истина;
			Элементы.ТаблицаОтборовЗначениеОтбораСиноним.КнопкаВыбора = Ложь;
			Для Каждого ЭлСписка Из Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора Цикл
				Элементы.ТаблицаОтборовЗначениеОтбораСиноним.СписокВыбора.Добавить(ЭлСписка.Значение, ЭлСписка.Представление);	
			КонецЦикла;
		Иначе
			Элементы.ТаблицаОтборовЗначениеОтбораСиноним.КнопкаВыпадающегоСписка = Ложь;
			Если ТипЗнч(Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора) = Тип("Дата") Тогда
				Элементы.ТаблицаОтборовЗначениеОтбораСиноним.КнопкаВыбора = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборовИспользованиеПриИзменении(Элемент)
	
	ИзменилисьОтборы = Истина;
	Если Элементы.ТаблицаОтборов.ТекущиеДанные.ИмяПоля = "ИнтервалДат" Тогда
		Элементы.ТаблицаОтборов.ТекущиеДанные.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОтборовВидСравненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Элементы.ТаблицаОтборов.ТекущиеДанные.ВидСравнения <> ВыбранноеЗначение Тогда
		ИзменилисьОтборы = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте                                                                                         
Процедура ТаблицаОтборовЗначениеОтбораСинонимПриИзменении(Элемент)
	Если Элементы.ТаблицаОтборов.ТекущиеДанные.СписокЗначенийЗначениеОтбора.Количество() = 0 И ЗначениеЗаполнено(Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним) Тогда 
		Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбора = Элементы.ТаблицаОтборов.ТекущиеДанные.ЗначениеОтбораСиноним;
		Элементы.ТаблицаОтборов.ТекущиеДанные.Использование = Истина;
		ИзменилисьОтборы = Истина;
	КонецЕсли;
КонецПроцедуры





