
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ES_ИзменяемыеРеквизитыЗаказов
	Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
		
		ЯчейкаПроблема = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ЯчейкаПроблема);
	
		Движения.ES_ИзменяемыеРеквизитыЗаказов.Записывать = Истина;
		Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказы.ЯчейкаПолучатель) Тогда
				Продолжить;
			КонецЕсли;
			Если ТекСтрокаЗаказы.Проверен Тогда
				
				//ТекСтрокаЗаказы.ЯчейкаПолучатель <> Ячейка 
				Если ТекСтрокаЗаказы.ЯчейкаТекущая <> ТекСтрокаЗаказы.ЯчейкаПолучатель Тогда	
					Движение 				= Движения.ES_ИзменяемыеРеквизитыЗаказов.Добавить();
					Движение.Период 		= Дата;
					Движение.Заказ 			= ТекСтрокаЗаказы.Заказ;
					Движение.РеквизитЗаказа = Перечисления.ES_ИзменяемыеРеквизитыЗаказа.Ячейка;
					Движение.Значение 		= ТекСтрокаЗаказы.ЯчейкаПолучатель;
				КонецЕсли;
			Иначе
				Если НЕ ТекСтрокаЗаказы.ЯчейкаТекущая = ЯчейкаПроблема Тогда
					Движение 				= Движения.ES_ИзменяемыеРеквизитыЗаказов.Добавить();
					Движение.Период 		= Дата;
					Движение.Заказ 			= ТекСтрокаЗаказы.Заказ;
					Движение.РеквизитЗаказа = Перечисления.ES_ИзменяемыеРеквизитыЗаказа.Ячейка;
					Движение.Значение 		= ЯчейкаПроблема;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	 
	Движения.ES_ЗаказыНаСкладе.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ES_ИнвентаризацияЗаказы.Заказ,
	|	ES_ИнвентаризацияЗаказы.Проверен
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ES_Инвентаризация.Заказы КАК ES_ИнвентаризацияЗаказы
	|ГДЕ
	|	ES_ИнвентаризацияЗаказы.Ссылка = &Ссылка
	|	И (ES_ИнвентаризацияЗаказы.ЯчейкаТекущая ЕСТЬ NULL
	|			ИЛИ ES_ИнвентаризацияЗаказы.ЯчейкаТекущая = &ПустаяЯчейка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ES_ЗаказыНаСкладеОстатки.Склад,
	|	ЕСТЬNULL(ES_ЗаказыНаСкладеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВТ_Заказы.Проверен
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_ЗаказыНаСкладе.Остатки(
	|				&МоментВремени,
	|				Заказ В
	|					(ВЫБРАТЬ
	|						ВТ_Заказы.Заказ
	|					ИЗ
	|						ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ЗаказыНаСкладеОстатки
	|		ПО ВТ_Заказы.Заказ = ES_ЗаказыНаСкладеОстатки.Заказ";
	
	Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 	Справочники.Ячейки.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проверен <> Истина Тогда			
			Продолжить;
		КонецЕсли;
		
		Если Выборка.КоличествоОстаток > 0 Тогда
			Продолжить;
			//Отказ = Истина;
			//Сообщить( НСтр("ru = 'Заказ " + Выборка.Заказ +" уже оприходован на склад " + Выборка.Склад +"'"));
		Иначе
			Движение = Движения.ES_ЗаказыНаСкладе.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Заказ = Выборка.Заказ;
			Движение.Количество	= 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
