
&НаКлиенте
Процедура ЗаКаждыеПриИзменении(Элемент)
	
	Элементы.Интервал.Видимость = Объект.ЗаКаждые;
	Элементы.ВесДо.Доступность = НЕ Объект.ЗаКаждые;
	
	ИнтервалПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалПриИзмененииНаСервере()
	//мОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ЗаКаждые Тогда
		//Объект.ВесДо = 1000000;
	Иначе
		Объект.ВесДо = 0;
		Объект.Интервал = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнтервалПриИзменении(Элемент)
	ИнтервалПриИзмененииНаСервере();
	СформироватьНаименование();
КонецПроцедуры

&Наклиенте
Процедура СформироватьНаименование()
	
	//Если НЕ Объект.ЗаКаждые Тогда
	//	Объект.Наименование = "Вес от "+Объект.ВесОт+" до "+Объект.ВесДо+" (кг.)";
	//Иначе
	//	Объект.Наименование = "За каждые "+Объект.Интервал+" от "+Объект.ВесОт+" (кг.)";
	//	//Объект.Наименование = "За каждые "+Объект.Интервал+" от "+Объект.ВесОт+" (кг.) - "+Объект.ВесДо+" (кг.)";
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВестОтПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВестДоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭР Несторук С.И. 10.04.2019 9:32:27 {
	ES_БиллингКлиент.ПроверитьДоступностьСервисаDelans(Отказ);
	//}ЭР Несторук С.И.
	Элементы.Интервал.Видимость = Объект.ЗаКаждые;
	Элементы.ВесДо.Доступность = НЕ Объект.ЗаКаждые;
КонецПроцедуры
