
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекстСообщенияXML = ИнтеграцияВЕТИС.ТекстСообщенияXMLИзПротокола(Объект.Ссылка);
	ТекстСообщенияXML = ИнтеграцияГосИС.ФорматироватьXMLСПараметрами(
		ТекстСообщенияXML,
		ИнтеграцияГосИС.ПараметрыФорматированияXML(Истина, "  "));

	ТекстовыйДокументТекстСообщенияXML.УстановитьТекст(ТекстСообщенияXML);
	
	РежимОтладки = ОбщегоНазначенияКлиентСервер.РежимОтладки();
	
	Элементы.ГруппаШапка.ТолькоПросмотр = Не РежимОтладки;
	Элементы.ГруппаСообщение.ТолькоПросмотр = Не РежимОтладки;
	
КонецПроцедуры

#КонецОбласти