&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств) Тогда
		ЗаполнитьВалютуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	ЗаполнитьВалютуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Объект.ВалютаДенежныхСредств = Объект.КассаККМ.ВалютаДенежныхСредств;
	КонецЕсли;
	
КонецПроцедуры
