
&НаКлиенте
Процедура ДекорацияQRAndroidНажатие(Элемент)
	
	ПерейтиВGooglePlay();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаAndroidНажатие(Элемент)
	
	ПерейтиВGooglePlay();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRiOSНажатие(Элемент)
	
	ПерейтиВAppStore();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаiOSНажатие(Элемент)
	
	ПерейтиВAppStore();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВGooglePlay()
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.SmallBusiness";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВAppStore()
	
	АдресСтраницы = "https://itunes.apple.com/us/app/1%D1%81-%D1%83%D0%BD%D1%84-%D0%B2-%D0%BE%D0%B1%D0%BB%D0%B0%D0%BA%D0%B5/id1440287699?l=ru&ls=1&mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры