
&НаКлиенте
Процедура СсылкаНаСайтНажатие(Элемент)
	
	АдресСсылки = "https://cp.42clouds.com/SignUp?ReferralAccountId=5cb39c9e-3cac-4c52-a91a-e18c338ab47f&CloudServiceId=a651a222-1ec7-4582-9c62-052b1bd50b96";
	#Если ВебКлиент Тогда
		ПерейтиПоНавигационнойСсылке(АдресСсылки);
	#Иначе
		
		ЗапуститьПриложение(АдресСсылки);
		
	#КонецЕсли	
		
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстПредупреждения") Тогда
		Элементы.ТекстПредупреждения.Заголовок = Параметры.ТекстПредупреждения;
	КонецЕсли;
	
	//Если Параметры.Свойство("СсылкаНаСайт") Тогда
	//	Элементы.СсылкаНаСайт.Заголовок = Параметры.СсылкаНаСайт;
	//КонецЕсли;
	
КонецПроцедуры

