
#Область ПрограммныйИнтерфейс

Функция СообщениеАдресованоАссистенту(Сообщение) Экспорт
	
	ИдентификаторАссистента = АссистентУправленияПовтИсп.АссистентИдентификаторПользовательСВ();
	
	Для каждого Получатель Из Сообщение.Получатели Цикл
		Если Получатель = ИдентификаторАссистента Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоСообщениеАссистента(Сообщение) Экспорт
	
	Возврат Сообщение.Автор = АссистентУправленияПовтИсп.АссистентИдентификаторПользовательСВ();
	
КонецФункции

Функция КодДействияСообщенияВыполнитьДействие() Экспорт
	
	Возврат "КодДиалога.Да";
	
КонецФункции

Функция КодДействияСообщенияОтмена() Экспорт
	
	Возврат "КодДиалога.Отмена";
	
КонецФункции

#КонецОбласти
