
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПодставитьСотрудника();
КонецПроцедуры

&НаСервере
Процедура ПодставитьСотрудника()
	Запись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(Запись.Пользователь.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	КонтрагентСтрока = ЭтотОбъект.ТекущийЭлемент.ВыделенныйТекст;
	Массив = ЗаполнитьСЗ(КонтрагентСтрока);
	Запись.Адрес = Массив;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСЗ(КонтрагентСтрока)
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(КонтрагентСтрока);
	//Массив = Новый Массив;
	АдресСсылка = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Доставка");
	Факт = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Факт. адрес");
	Юр = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Юр. адрес");
	
	Для Каждого ТекСтр ИЗ Контрагент.КонтактнаяИнформация Цикл
		Если ТекСтр.Вид = АдресСсылка ИЛИ ТекСтр.Вид = Факт ИЛИ ТекСтр.Вид = Юр Тогда
			Адрес = ТекСтр.Представление;//Массив.Добавить(ТекСтр.Представление);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Адрес;//Массив;
КонецФункции

&НаСервере
Процедура ПослеОтметкиЭлементов(СписокСкладов, Параметры) Экспорт
	Если СписокСкладов = Неопределено Тогда
		Сообщить("Отказ от выбора складов.");
	Иначе
		Для каждого Элемент из СписокСкладов Цикл
			Если Элемент.Пометка Тогда
				//Стр ="" + Стр + "; " + Элемент;
				МенеджерЗаписи = РегистрыСведений.ES_НастройкаДоступаПользователей.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.СкладыСПР = Элемент.Значение;
				МенеджерЗаписи.Пользователь = Запись.Пользователь;
				МенеджерЗаписи.ВидОперации = Запись.ВидОперации;
				МенеджерЗаписи.ВидОперацииПеремещения2 = Запись.ВидОперацииПеремещения2;
				МенеджерЗаписи.ВидОперацииПриемки = Запись.ВидОперацииПриемки;
				МенеджерЗаписи.ВидыОперацииПриемки2 = Запись.ВидыОперацииПриемки2;
				МенеджерЗаписи.Контрагент = Запись.Контрагент;
				МенеджерЗаписи.Сотрудник = Запись.Сотрудник;
				МенеджерЗаписи.СтруктурнаяЕдиница = Запись.СтруктурнаяЕдиница;
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСпр()
	МассивЗначений= Новый Массив;
	Выборка = Справочники.СтруктурныеЕдиницы.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивЗначений.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивЗначений;
КонецФункции

&НаКлиенте
Процедура ВыбратьСклады(Команда)
	МассивЗначений = ПолучитьСпр();
	СписокСкладов.ЗагрузитьЗначения(МассивЗначений);
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);	
	СписокСкладов.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов,"Выберите склады:");
КонецПроцедуры