
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		
	Движения.ES_Поставка.Записывать = Истина;
	ТабСведенияОЗаказе 	= ES_ФормированиеДвиженийПоРегистрамДоставки.СоздатьТаблицуСведенийОЗаказах();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_ПоставкаЗаказы.Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ES_Поставка.Заказы КАК ES_ПоставкаЗаказы
	|ГДЕ
	|	ES_ПоставкаЗаказы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ЕСТЬNULL(ES_ПоставкаОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_Поставка.Остатки(
	|				&Дата,
	|				Заказ В
	|					(ВЫБРАТЬ
	|						ВТ_Заказы.Заказ
	|					ИЗ
	|						ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ПоставкаОстатки
	|		ПО ВТ_Заказы.Заказ = ES_ПоставкаОстатки.Заказ";	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоОстаток > 0 Тогда
			Сообщить("По документу "+Выборка.Заказ+ " уже сформирован документ поставки"); 
			Отказ = Истина;
		Иначе
			
			Движение = Движения.ES_Поставка.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Заказ = Выборка.Заказ;
			Движение.Количество = 1;
			
			// РС ES_СведенияОЗаказах - заполнение таблицы
			НоваяСтрока = ТабСведенияОЗаказе.Добавить();
			НоваяСтрока.Движения 		= Движения.ES_СведенияОЗаказах;
			НоваяСтрока.Период 			= Дата;//ПериодПроведения;
			НоваяСтрока.Регистратор 	= Ссылка;
			НоваяСтрока.Заказ 			= Выборка.Заказ;
			НоваяСтрока.Поставка	 	= Ссылка;

			
		КонецЕсли;
		
		
	КонецЦикла;
	
	  // РС ES_СведенияОЗаказах
		ES_ФормированиеДвиженийПоРегистрамДоставки.СделатьЗаписьВРССведенияОЗаказах(ТабСведенияОЗаказе, Дата);//ПериодПроведения);
				

	
	
КонецПроцедуры

