
// Процедура вносит в информационную базу данные, которые присланы из узла УзелОбмена 
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение",с которым осуществляется обмен 
//  ДанныеОбмена - пакет обмена полученный из узла УзелОбмена, помещенный в ХранилищеЗначения
//  ОчиститьИзменения - параметр определяет, нужно ли очищать ранее отправленные изменения
//
Процедура ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена = Ложь, ОчиститьИзменения = Ложь) Экспорт
	МассивНастроек = ПолучитьСтартовыеНастройки();
	 
	ЧтениеXML = Новый ЧтениеXML;
	
	Если МассивНастроек[0] = "FTP" Тогда
		FTPСоединение = Новый FTPСоединение(СокрЛП(МассивНастроек[1]), ?(Число(МассивНастроек[2]) = 0, Неопределено, МассивНастроек[2]),
													СокрЛП(МассивНастроек[3]),МассивНастроек[4],,Истина,,);
		
		Каталог = СокрЛП(МассивНастроек[5]) + "out/";
		FTPСоединение.УстановитьТекущийКаталог(Каталог);
		
		МассивФайлов = FTPСоединение.НайтиФайлы(Каталог, "*.xml", Истина);
		ИмяФайлаНаFTP  = "message01_" + УзелОбмена.Префикс + ".xml";
		
		Если МассивФайлов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Элемент Из МассивФайлов Цикл
			Если ИмяФайлаНаFTP = Элемент.Имя Тогда
				
				ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");	
				FTPСоединение.Получить(ИмяФайлаНаFTP, ВременныйФайл);
				
				Попытка
					ЧтениеXML.ОткрытьФайл(ВременныйФайл);
				Исключение
					Сообщить("ошибка чтения файла");	
				КонецПопытки;
				
				ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
				ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
				
				Если ОчиститьИзменения Тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
				КонецЕсли;
				
				ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	
				Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
				EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
				
			КонецЕсли;
			
		КонецЦикла;
		
		//ИмяФайлаНаFTP  = "message01_" + УзелОбмена.Префикс + ".xml";
		//ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
		//
		//FTPСоединение.Получить(ИмяФайлаНаFTP, ВременныйФайл);

		
		//ИмяФайла = "E:\Файлы\Коваленко\Логсервис\ftp_обмен\out\messageOS_ЦБ.xml";
		//Попытка
		//	ЧтениеXML.ОткрытьФайл(ВременныйФайл);
		//Исключение
		//	Сообщить("ошибка чтения файла");	
		//КонецПопытки;
		
	Иначе
		ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
		
		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
		
		Если ОчиститьИзменения Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
		КонецЕсли;
		
		ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	
		Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
		EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
		
	КонецЕсли;
	
	//ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	//ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
		
	//проверить это условие
	//Если ОчиститьИзменения Тогда
	//	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	//КонецЕсли;
		
	//ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	//
	//Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	//
	//EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
	
	Если Не ЧтениеСообщения = Неопределено Тогда
		ЧтениеСообщения.ЗакончитьЧтение();
	КонецЕсли;
	
	ЧтениеXML.Закрыть();
	
	Если МассивНастроек[0] = "FTP" Тогда
		Попытка
			FTPСоединение.Удалить(ИмяФайлаНаFTP);
		Исключение
			
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ПринятьПакетОбмена()

// Функция формирует пакет обмена, который будет отправлен узлу УзелОбмена
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение", с которым осуществляется обмен
//
// Возвращаемое значение:
//  сформированный пакет, помещенный в хранилище значения
Функция СформироватьПакетОбмена(УзелОбмена, КодМобильногоКомпьютера) Экспорт
	МассивНастроек = ПолучитьСтартовыеНастройки();
	
	ПользовательМобильногоУстройства = ПланыОбмена.EFSOL_МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера).Пользователь;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если Ложь Тогда
		FTPСоединение = Новый FTPСоединение(СокрЛП(МассивНастроек[1]), ?(Число(МассивНастроек[2]) = 0, Неопределено, МассивНастроек[2]),
													СокрЛП(МассивНастроек[3]),МассивНастроек[4],,Истина,,);
		
		Каталог = СокрЛП(МассивНастроек[5]) + "in/";
		FTPСоединение.УстановитьТекущийКаталог(Каталог);	
		ИмяФайлаНаFTP  = "message" + УзелОбмена.Префикс + "_01.xml";		
		ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");

		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
		ЗаписьXML.ОткрытьФайл(ВременныйФайл, ПараметрыЗаписиXML);
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;
	
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
		
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
		
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	//ES_Коваленко М.{ //при первой синхронизации
	Если УзелОбмена.НомерОтправленного = 0 И УзелОбмена.НомерПринятого = 0 Тогда
		ВыборкаИзменений = ПолучитьОтчетыОДоставке(ПользовательМобильногоУстройства);
		ПерваяСинхронизация = Истина;
	Иначе
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
		ПерваяСинхронизация = Ложь;
	КонецЕсли;	
	// } ES_Коваленко
		
	ВозвращаемыйСписок = EFSOL_ОбменМобильноеПриложениеПереопределяемый.СоздатьОбъектXDTO("Objects");
	
	Пока ВыборкаИзменений.Следующий() Цикл
		Если ПерваяСинхронизация Тогда
			Данные = ВыборкаИзменений.Ссылка;
		Иначе	
			Данные = ВыборкаИзменений.Получить();
		КонецЕсли;
		
		//учитываем только документы ОтчетОДоставке, спр. пользователи передавать не будем	
		
		Если НЕ ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
			Если Данные.Курьер.Пустая() Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Данные);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если (ТипЗнч(Данные) = Тип("УдалениеОбъекта")) 
			ИЛИ (Данные.Курьер = ПользовательМобильногоУстройства И Данные.Проведен) Тогда //И НЕ Данные.ES_ЗакрытКурьером) Тогда
			EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗаписатьДанные(ВозвращаемыйСписок, Данные);
		Иначе
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Данные);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Ложь Тогда
	
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
		ЗаписьСообщения.ЗакончитьЗапись();
		
		ЗаписьXML.Закрыть();
		FTPСоединение.Записать(ВременныйФайл, ИмяФайлаНаFTP);
		Возврат Новый ХранилищеЗначения("success", Новый СжатиеДанных(9));
	Иначе
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
		ЗаписьСообщения.ЗакончитьЗапись();
		Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
		
	КонецЕсли;
			
КонецФункции // СформироватьПакетОбмена()

Функция ПолучитьОтчетыОДоставке(ПользовательМобильного)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ES_ОтчетОДоставке.Ссылка
	               |ИЗ
	               |	Документ.ES_ОтчетОДоставке КАК ES_ОтчетОДоставке
	               |ГДЕ
	               |	ES_ОтчетОДоставке.Курьер = &ПользовательМобильногоУстройства
	               |	И ES_ОтчетОДоставке.Дата >= &Дата";
	//ПользовательМобильного = Справочники.Сотрудники.НайтиПоНаименованию(ПользовательМобильногоУстройства);
	Если ПользовательМобильного = Неопределено Тогда
		ПользовательМобильного = Справочники.Сотрудники.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПользовательМобильногоУстройства",ПользовательМобильного);
	Запрос.УстановитьПараметр("Дата",НачалоНедели(ТекущаяДата()));
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
КонецФункции

Функция ПолучитьСтартовыеНастройки()
	Запрос = Новый Запрос();
	МассивНастроек = Новый Массив();
	
	Запрос.Текст = "ВЫБРАТЬ
		|	""ES_Переключатель"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь = &Пользователь
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Переключатель)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_FTPСервер"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_FTPСервер)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ES_СтартовыеНастройки.Значение,
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_FTPПорт)
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Пользователь"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Пользователь)
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Пароль"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Пароль)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Каталог"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Каталог)";
		
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	
	//КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНастроек.Добавить(Выборка.Значение);	
	КонецЦикла;
		
	Возврат МассивНастроек;
КонецФункции




