
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКомандыПланДоставки);
	//// Конец СтандартныеПодсистемы.Печать
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	МассивОбъековПечати = Новый Массив;
	Для каждого Стр Из ЭтаФорма.СписокДокументовДляПечати Цикл
		Если  Стр.НеобходимоПечатать = Истина Тогда		
			МассивОбъековПечати.Добавить(Стр.ДокументДоставки);			
		КонецЕсли;
	КонецЦикла;
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, МассивОбъековПечати);
КонецПроцедуры


//EFSOL_oks_kry_18.03.2015 21:42:31_END  


&НаКлиенте
Процедура ПечатьСтикеров(Команда)
	
	МассивОбъековПечати = Новый Массив;
	Для каждого Стр Из ЭтаФорма.СписокДокументовДляПечати Цикл
		Если  Стр.НеобходимоПечатать = Истина Тогда		
			МассивОбъековПечати.Добавить(Стр.ДокументДоставки);			
		КонецЕсли;
	КонецЦикла; 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Документ.ES_ПланДоставки",
	"ПФ_MXL_ES_Стикер",
	МассивОбъековПечати,
	Неопределено,
	Неопределено
	);

КонецПроцедуры


&НаКлиенте
Процедура ПечатьНакладных(Команда)
	МассивОбъековПечати = Новый Массив;
	Для каждого Стр Из ЭтаФорма.СписокДокументовДляПечати Цикл
		Если  Стр.НеобходимоПечатать = Истина Тогда		
			МассивОбъековПечати.Добавить(Стр.ДокументДоставки);			
		КонецЕсли;
	КонецЦикла; 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Документ.ES_ПланДоставки",
	"ПФ_MXL_ES_НакладнаяB2B",
	МассивОбъековПечати,
	Неопределено,
	Неопределено
	);  
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

