Функция СведенияОВнешнейОбработке() Экспорт
	
	ДанныеДляРег = Новый Структура();
	ДанныеДляРег.Вставить("Наименование", "Подключение к Боту Телеграм");
	ДанныеДляРег.Вставить("БезопасныйРежим", Истина);
	ДанныеДляРег.Вставить("Версия", "ver.:1.001");
	ДанныеДляРег.Вставить("Информация", "Обработка для Бот Телеграм");
	ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");
	
	ТабЗнКоманды = Новый ТаблицаЗначений;
	ТабЗнКоманды.Колонки.Добавить("Идентификатор");
	ТабЗнКоманды.Колонки.Добавить("Использование");
	ТабЗнКоманды.Колонки.Добавить("Представление");
	
	НоваяСтрока = ТабЗнКоманды.Добавить();
	НоваяСтрока.Идентификатор = "ОткрытьОбработку";
	НоваяСтрока.Использование = "ОткрытиеФормы";
	НоваяСтрока.Представление = "Подключение к сервису";
	ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);
	
	Возврат ДанныеДляРег;
	
	
КонецФункции

Процедура ВыполнитьОбработку() Экспорт
ФормаОбработки = ЭтотОбъект.ПолучитьФорму("ФормаУпр");
	
ФормаОбработки.Открыть();
	
КонецПроцедуры
