

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;
	
	Для каждого Стр Из Заказы Цикл
		НовСтр = ЗаказыПоОтметкам.Добавить();
		НовСтр.ДокументДоставки = Стр.ДокументДоставки;
		НовСтр.АдресДоставки = Стр.АдресДоставки;
		НовСтр.СтатусЗаказа = Стр.СтатусЗаказа;
		НовСтр.НомерНакладной = Стр.НомерНакладной;
	КонецЦикла;
	
	Элементы.ЗаказыПоШтрихкодуВвестиСканером.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F7);
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтатустПоОтметке(Команда)

	СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов."+ СтрЗаменить(НовыйСтатусПоОтметке, " ", ""));
	СтатусЗабораДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаборов."+ СтрЗаменить(НовыйСтатусПоОтметке, " ", ""));
	Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;
		
	ПоменятьСтатусыВТаблицеСОтметками(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы);
		
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьСтатусыВТаблицеСОтметками(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы)
	
	Для каждого Стр Из ЗаказыПоОтметкам Цикл
		
		Если Стр.Отметка Тогда
		ПоменятьСтатусы(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьСтатусыВТаблицеПоШтрихкодам(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы)
	
	Если ЗаказыПоШтрихкоду.Количество() > 0 Тогда
		
		Для каждого Стр Из ЗаказыПоШтрихкоду Цикл
			ПоменятьСтатусы(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы, Стр);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоменятьСтатусы(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы, Строка)
	
			НайденнаяСтрока = Заказы.НайтиСтроки(Новый Структура("ДокументДоставки", Строка.ДокументДоставки));
			Если ТипЗнч(НайденнаяСтрока[0].ДокументДоставки) = Тип("ДокументСсылка.ЗаказПокупателя") 
				И НЕ СтатусЗаказаДляИзменения = Неопределено Тогда
				НайденнаяСтрока[0].СтатусЗаказа = СтатусЗаказаДляИзменения;
				Строка.СтатусЗаказа = СтатусЗаказаДляИзменения; 
			КонецЕсли;
			Если ТипЗнч(НайденнаяСтрока[0].ДокументДоставки) = Тип("ДокументСсылка.ES_ЗаборГруза")
				И НЕ СтатусЗабораДляИзменения = Неопределено Тогда
				НайденнаяСтрока[0].СтатусЗаказа = СтатусЗабораДляИзменения;
				Строка.СтатусЗаказа = СтатусЗабораДляИзменения; 
			КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоШтрихкодуШтрихКодПриИзменении(Элемент)
	
	Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;
	ТекДанные = Элементы.ЗаказыПоШтрихкоду.ТекущиеДанные;
	
	
	Если ЗначениеЗаполнено(ТекДанные.ШтрихКод) Тогда
		
		ТекДанные.ШтрихКод = ES_ОбщегоНазначения.ШтрихКодУдалитьЛишниеСимволы(ТекДанные.ШтрихКод);
		
		НайденныеШтрихКоды = ЗаказыПоШтрихкоду.НайтиСтроки(Новый Структура("ШтрихКод", ТекДанные.ШтрихКод));
		Если НайденныеШтрихКоды.Количество() > 1 Тогда
			Сообщить(""+ТекДанные.ШтрихКод+ " уже считан");
			ЗаказыПоШтрихкоду.Удалить(ЗаказыПоШтрихкоду.Количество()-1);
			Возврат;
		КонецЕсли;
		
		Результат = Заказы.НайтиСтроки(Новый Структура("НомерНакладной", ТекДанные.ШтрихКод)); 
		Если ЗначениеЗаполнено(Результат) Тогда
			 			
			ТекДанные.ДокументДоставки = Результат[0].ДокументДоставки;
			ТекДанные.АдресДоставки = Результат[0].АдресДоставки;
			ТекДанные.СтатусЗаказа = Результат[0].СтатусЗаказа;
			ТекДАнные.СвязанныйДокумент = Результат[0].СвязанныйДокумент;
			
			Если Результат.Количество() = 2 Тогда
				
				НовСтр = ЗаказыПоШтрихкоду.Добавить();
				НовСтр.ШтрихКод = ТекДанные.ШтрихКод;
				НовСтр.ДокументДоставки = Результат[1].ДокументДоставки;
				НовСтр.АдресДоставки = Результат[1].АдресДоставки;
				НовСтр.СтатусЗаказа = Результат[1].СтатусЗаказа;
				НовСтр.СвязанныйДокумент = Результат[1].СвязанныйДокумент;
			КонецЕсли;
		    	
			Иначе
			Сообщить("Заказ с номером накладной " + ТекДанные.ШтрихКод + " в отчете не найден");
			ЗаказыПоШтрихкоду.Удалить(ЗаказыПоШтрихкоду.Количество()-1);

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусПоШтрихКоду(Команда)
	
	СтатусЗаказаДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаказов."+ СтрЗаменить(НовыйСтатусПоШтрихКоду, " ", ""));
	СтатусЗабораДляИзменения = ПредопределенноеЗначение("Перечисление.ES_СтатусыЗаборов."+ СтрЗаменить(НовыйСтатусПоШтрихКоду, " ", ""));
	Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;

	ПоменятьСтатусыВТаблицеПоШтрихкодам(СтатусЗаказаДляИзменения, СтатусЗабораДляИзменения, Заказы);  
	ЭтаФорма.Закрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитсьВсе(Команда)
	
	Для каждого Стр Из ЗаказыПоОтметкам Цикл
		Стр.Отметка = Истина;
	КонецЦикла;
		
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	Для каждого Стр Из ЗаказыПоОтметкам Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВвестиСканером(Команда)
	
	ОчиститьСообщения();
	
	ТекШтрихкод = "";	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ОбработатьШтрихкодЗавершение", ЭтаФорма), ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));

	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	
	Если НЕ ПустаяСтрока(Результат) Тогда
		Результат = ES_ОбщегоНазначения.ШтрихКодУдалитьЛишниеСимволы(Результат);

		Заказы = ЭтаФорма.ВладелецФормы.Объект.Заказы;
		НайденныеШтрихКоды = ЗаказыПоШтрихкоду.НайтиСтроки(Новый Структура("ШтрихКод", Результат));
		Если НайденныеШтрихКоды.Количество() >= 1 Тогда
			Сообщить(""+Результат+ " уже считан");
			Возврат;
		КонецЕсли;
		
		НайденныеЗаказы = Заказы.НайтиСтроки(Новый Структура("НомерНакладной", Результат)); 
		Если ЗначениеЗаполнено(НайденныеЗаказы) Тогда
			 			
			НовСтр = ЗаказыПоШтрихкоду.Добавить();
			НовСтр.ШтрихКод = Результат;
			НовСтр.ДокументДоставки = НайденныеЗаказы[0].ДокументДоставки;
			НовСтр.АдресДоставки = НайденныеЗаказы[0].АдресДоставки;
			НовСтр.СтатусЗаказа = НайденныеЗаказы[0].СтатусЗаказа;
			НовСтр.СвязанныйДокумент = НайденныеЗаказы[0].СвязанныйДокумент;
			
			Если НайденныеЗаказы.Количество() = 2 Тогда
				
				НовСтр = ЗаказыПоШтрихкоду.Добавить();
				НовСтр.ШтрихКод = Результат;
				НовСтр.ДокументДоставки = НайденныеЗаказы[1].ДокументДоставки;
				НовСтр.АдресДоставки = НайденныеЗаказы[1].АдресДоставки;
				НовСтр.СтатусЗаказа = НайденныеЗаказы[1].СтатусЗаказа;
				НовСтр.СвязанныйДокумент = НайденныеЗаказы[1].СвязанныйДокумент;
			КонецЕсли;
		    	
			Иначе
			Сообщить("Заказ с номером накладной " + Результат + " в отчете не найден");
			//ЗаказыПоШтрихкоду.Удалить(ЗаказыПоШтрихкоду.Количество()-1);

		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры


	
