// СОБЫТИЯ ЭЛЕМЕНТОВ

#Область ОбработчикиСобытийЭлементовФормы

Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ES_ШаблоныSMS.Ссылка
		|ИЗ
		|	Справочник.ES_ШаблоныSMS КАК ES_ШаблоныSMS
		|ГДЕ
		|	ES_ШаблоныSMS.ВидШаблонаSMS = &ВидШаблонаSMS
		|	И ES_ШаблоныSMS.Основной
		|	И НЕ ES_ШаблоныSMS.ЭтоГруппа
		|	И НЕ ES_ШаблоныSMS.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ВидШаблонаSMS", ВидШаблонаSMS);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектСпр = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСпр.Основной = Ложь;
			ОбъектСпр.Записать();
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
