&НаСервере
Процедура СформироватьQR()
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	QRСтрока = "sbmcs" + ";" + АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства + ";" + Пользователь; 
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
	QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	
	Если Найти(АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства, "e1c://") = Истина Тогда
		Элементы.ГруппаШаг2Заголовок.Видимость = Ложь;
		Элементы.ГруппаШаг2.Видимость = Ложь;
		Элементы.ДекорацияШаг1.Видимость = Ложь;
	Иначе
		Элементы.ГруппаШаг2Заголовок.ГруппаШаг2Заголовок.Видимость = Истина;
		Элементы.ГруппаШаг2.ГруппаШаг2Заголовок.Видимость = Истина;
		Элементы.ДекорацияШаг1.ГруппаШаг2Заголовок.Видимость = Истина;
		Элементы.ДекорацияШаг2Заголовок.Заголовок = НСТр("ru='После загрузки мобильного приложения используйте этот QR-код для установки соединения'");
	Конецесли;
		
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ТекПользователь = Пользователи.ТекущийПользователь();
		Если ТекПользователь.Наименование= "<Не указан>" Тогда
			Пользователь = "";
		Иначе
			Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Сценарий = "Директор";
	СформироватьQR();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.MobileSmallBusiness";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.SmallBusinessMobile";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRiOSНажатие(Элемент)
	
	АдресСтраницы = "https://itunes.apple.com/us/app/id1459657913?l=ru&ls=1&mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаiOSНажатие(Элемент)
	
	АдресСтраницы = "https://itunes.apple.com/ru/app/1s-unf/id590223043?mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Оповестить("НастройкаМобильногоПриложенияГотово");
	
КонецПроцедуры

