 
// Описание внешней обработки
//
Функция СведенияОВнешнейОбработке() Экспорт 
	
	РегистрационныеДанные = Новый Структура;
	
	РегистрационныеДанные.Вставить("Наименование", "Запуск программы ""Загрузка документов""");
	
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	
	РегистрационныеДанные.Вставить("Версия", "1.1");
		
	//ВерсияКонфигурации = ПолучитьВерсиюКонфигурации();

	//РегистрационныеДанные.Вставить("ВерсияКонфигурации", ВерсияКонфигурации);
	
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	РегистрационныеДанные.Вставить( "Информация", "Загрузка документов в базу 1С");
	
	//РегистрационныеДанные.Вставить("ИспользуемоеИмяФайла", ИспользуемоеИмяФайла);

	
	///////////// команды /////////////////////////
	
	тзКоманд = Новый ТаблицаЗначений;
	
	тзКоманд.Колонки.Добавить("Идентификатор");
	
	тзКоманд.Колонки.Добавить("Представление");
	
	тзКоманд.Колонки.Добавить("Модификатор");
	
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	
	строкаКоманды.Идентификатор = "1";
	
	строкаКоманды.Представление = "Запуск программы ""Загрузка документов""";
	
	строкаКоманды.ПоказыватьОповещение = Истина;
	
	строкаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	            
	Возврат РегистрационныеДанные;
	
КонецФункции                                                    
                                                                                                      