
#Область ПрограммныйИнтерфейс

// Устанавливает имя и параметры формы сопоставления номенклатуры и алкогольной продукции.
//
// Параметры:
//  ИмяФормы - Строка - имя формы сопоставления номенклатуры и алкогольной продукции;
//  ПараметрыФормы - Структура - параметры открываемой формы, содержит:
//    АлкогольнаяПродукция - СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС - Сопоставляемая алкогольная продукция.
//    НоменклатураДляВыбора - Массив - массив номенклатуры для быстрого выбора.
//  Владелец - УправляемаяФорма, Неопределено - Форма-владелец;
//  ОписаниеОповещенияОЗакрытии - ОписаниеОповещения - описание оповещения о закрытии формы.
//
Процедура ИмяИПараметрыФормыСопоставления(ИмяФормы, ПараметрыФормы, Владелец, ОписаниеОповещенияОЗакрытии) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает имя события, которое наступает при записи документа поступления в базу данных.
//
Функция ИмяСобытияЗаписиПоступленияТоваров() Экспорт
	
	
	Возврат "Запись_ПоступлениеТоваровУслуг";
	
КонецФункции

// Возвращает реквизиты номенклатуры для выбора алкогольной продукции.
//
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ВидАлкогольнойПродукции - СправочникСсылка.ВидыАлкогольнойПродукции - Вид алкогольной продукции.
//
Функция РеквизитыНоменклатурыДляВыбораАлкогольнойПродукции(Номенклатура) Экспорт
	
	Реквизиты = Новый Структура("ВидАлкогольнойПродукции");
	
	
	Возврат Реквизиты;
	
КонецФункции

#КонецОбласти

// см ИнтеграцияЕГАИСКлиент.ДляУказанияСерийНуженСерверныйВызов
//
Функция ДляУказанияСерийНуженСерверныйВызов(Форма, ПараметрыУказанияСерий, Текст, ТекущиеДанные = Неопределено) Экспорт
	
	
	Возврат Ложь;
	
КонецФункции
