
&НаКлиенте
Процедура СписокЗаказовШтрихкодПриИзменении(Элемент)
	ТекДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Штрихкод) Тогда
		ТекДанные.Штрихкод = ES_ОбщегоНазначения.ШтрихКодУдалитьЛишниеСимволы(ТекДанные.Штрихкод);
		
		НайденныеШтрихКоды = СписокЗаказов.НайтиСтроки(Новый Структура("Штрихкод", ТекДанные.Штрихкод));
		Если НайденныеШтрихКоды.Количество() > 1 Тогда
			Сообщить(""+ТекДанные.Штрихкод+ " уже считан");
			СписокЗаказов.Удалить(СписокЗаказов.Количество()-1);
			Возврат;
		КонецЕсли;
		
		Результат = НайтиЗаказНаСервере(ТекДанные.Штрихкод); 
		Если ЗначениеЗаполнено(Результат) Тогда
			//Если ТипЗнч(Результат) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//	ТекДанные.Заказ = Результат;
			//ИначеЕсли ТипЗнч(Результат) = Тип("Строка")Тогда
			//	Сообщить(Результат);
			//КонецЕсли;
			ТекДанные.Заказ = Результат;
		КонецЕсли;
	КонецЕсли;

	//НовСтр = СписокЗаказов.Добавить();
	//ИндексТекущейСтроки = СписокЗаказов.Индекс(ТекДанные);
	//Элементы.СписокЗаказов.ТекущаяСтрока = СписокЗаказов[ИндексТекущейСтроки+1].ПолучитьИдентификатор();	
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	Для каждого Стр Из СписокЗаказов Цикл
		Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			ПровестиЗаказНаСервере(Стр.Заказ);
		КонецЕсли;
	КонецЦикла;
	СписокЗаказов.Очистить();
	
	
КонецПроцедуры

&НаСервере 
Процедура ПровестиЗаказНаСервере (Заказ)
	Попытка 
		мОбъект = Заказ.ПолучитьОбъект();
		мОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить(""+ Заказ + " проведен");
	Исключение
		Сообщить("Не удалось провести " + Заказ);
	КонецПопытки;
	
	     
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказовШтрихкодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
			
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиЗаказНаСервере(Накладная)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	(ЗаказПокупателя.ES_ВхНакладная = &Накладная
	|			ИЛИ ЗаказПокупателя.ES_НомерНакладной = &Накладная)
	|	И ЗаказПокупателя.Проведен = ЛОЖЬ
	|	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
	|	И ЗаказПокупателя.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецГода(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() > 1 Тогда
			Результат = "Поле Штрихкод не уникально";
		Иначе
			Выборка.Следующий();
			
			Результат = Выборка.Ссылка;
			
		КонецЕсли;
	Иначе 
		Результат = "Заказ не найден";
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СписокЗаказовШтрихкодИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	//ТекДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	//Если ЗначениеЗаполнено(ТекДанные.Штрихкод) Тогда
	//Результат = НайтиЗаказНаСервере(ТекДанные.Штрихкод); 
	//	Если ЗначениеЗаполнено(Результат) Тогда
	//		Если ТипЗнч(Результат) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//			ТекДанные.Заказ = Результат;
	//		ИначеЕсли ТипЗнч(Результат) = Тип("Строка")Тогда
	//		Сообщить(Результат);
	//		КонецЕсли;
	//	КонецЕсли;
	//
	//НовСтр = СписокЗаказов.Добавить();
	//ИндексТекущейСтроки = СписокЗаказов.Индекс(ТекДанные);
	//Элементы.СписокЗаказов.ТекущаяСтрока = СписокЗаказов[ИндексТекущейСтроки+1].ПолучитьИдентификатор();	
	//	
	//	
	//КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиСканером(Команда)
	
	ОчиститьСообщения();
	
	ТекШтрихкод = "";	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ОбработатьШтрихкодЗавершение", ЭтаФорма), ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Результат = ES_ОбщегоНазначения.ШтрихКодУдалитьЛишниеСимволы(Результат);
		Заказ = НайтиЗаказНаСервере(Результат);
		
		Если ЗначениеЗаполнено(Заказ) Тогда 
			
			НайденныеШтрихКоды = СписокЗаказов.НайтиСтроки(Новый Структура("Штрихкод", Результат));
			Если НайденныеШтрихКоды.Количество() >= 1 Тогда
				Сообщить(""+Результат+ " уже считан");
				Возврат;
			КонецЕсли;
			
			НовСтр = СписокЗаказов.Добавить();
			НовСтр.Штрихкод = Результат;
			НовСтр.Заказ = Заказ;
			
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры



