
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ES_МатрицаЗон.Записывать = Истина;
	Для Каждого ТекСтрокаЗоныТЧ Из ЗоныТЧ Цикл
		Движение = Движения.ES_МатрицаЗон.Добавить();
		Движение.Период = Дата;
		Движение.Направление = ТекСтрокаЗоныТЧ.Направление;
		Движение.Продукт = ТекСтрокаЗоныТЧ.Срочность;
		Движение.Зона = ТекСтрокаЗоныТЧ.Зона;
		Движение.СрокДоставки = ТекСтрокаЗоныТЧ.СрокДоставки;
		Движение.ВидКонтрагента = ТекСтрокаЗоныТЧ.ВидКонтрагента;
	КонецЦикла;

КонецПроцедуры
