Перем SessionId;

&НаКлиенте
Процедура ОтправитьМассово(Команда)
	ОтправитьМассовоНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Баланс(Команда)
	//БалансНаСервере();
	 БалансНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьМассовоНаСервере()
	
	//МассоваяОтправка(0);	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьМассовоНаСервере();

КонецПроцедуры

&НаСервере
Процедура БалансНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.БалансНаСервере();
	// Вставить содержимое обработчика.
КонецПроцедуры

