
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументПоставка") И Параметры.Свойство("ДокументПриемка") Тогда
		ЗаполнитьТЧ(Параметры.ДокументПоставка,Параметры.ДокументПриемка);
		ДокументПоставка = Параметры.ДокументПоставка;
		ДокументПриемка = Параметры.ДокументПриемка;
	КонецЕсли;
	
	
		    	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ (ДокументПоставка,ДокументПриемка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ES_ПоставкаЗаказы.Заказ КАК ЗаказВПоставке,
		|	1 КАК КоличествоПлан
		|ПОМЕСТИТЬ ВТ_Поставка
		|ИЗ
		|	Документ.ES_Поставка.Заказы КАК ES_ПоставкаЗаказы
		|ГДЕ
		|	ES_ПоставкаЗаказы.Ссылка = &ДокументПоставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ES_ПриемкаЗаказы.Заказ КАК ЗаказВПриемке,
		|	ЕСТЬNULL(ES_ПриемкаЗаказы.Некондиция, ЛОЖЬ) КАК Некондиция
		|ПОМЕСТИТЬ ВТ_Приемка
		|ИЗ
		|	Документ.ES_Приемка.Заказы КАК ES_ПриемкаЗаказы
		|ГДЕ
		|	ES_ПриемкаЗаказы.Ссылка = &ДокументПриемка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Поставка.ЗаказВПоставке КАК Заказ,
		|	ВТ_Поставка.КоличествоПлан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Приемка.ЗаказВПриемке, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоФакт,
		|	ВТ_Приемка.Некондиция
		|ИЗ
		|	ВТ_Поставка КАК ВТ_Поставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Приемка КАК ВТ_Приемка
		|		ПО ВТ_Поставка.ЗаказВПоставке = ВТ_Приемка.ЗаказВПриемке";
	
	Запрос.УстановитьПараметр("ДокументПоставка", ДокументПоставка);
	Запрос.УстановитьПараметр("ДокументПриемка", ДокументПриемка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Заказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ДокументПриемка.Видимость = ЗначениеЗаполнено(ДокументПриемка);
	Элементы.ДокументПоставка.Видимость = ЗначениеЗаполнено(ДокументПоставка);
	
КонецПроцедуры


