
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭР Сальник К.А. 13.04.2018 17:37:00 {
	
	//Если Не ES_YandexMaps.ПроверкаИнтернет() Тогда
	//	Сообщить("Нет соединения с интернетом");
	//	Возврат;
	//КонецЕсли;
	
	//Карта = ES_YandexMaps.ПолучитьТекстКартыВыбораАдреса(Новый Структура("Долгота, Широта", СтрЗаменить(Параметры.Долгота, ",", "."), СтрЗаменить(Параметры.Широта, ",", ".")));
		Карта = ES_OpenStreetMap.ПолучитьКарту(Новый Структура("Долгота, Широта, Адрес, Метро", Параметры.Долгота, Параметры.Широта, Параметры.Адрес, Параметры.Метро));
	//} ЭР Сальник К.А.
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруГеокодирования()
	
	СтруктураГеокодирования = Новый Структура("ФорматированныйАдрес, Широта, Долгота, Метро, Расстояние", "", 0, 0, "", 0);
	
	Если ES_YandexMaps.ПроверкаИнтернет() Тогда		
		
		ВыбранныйАдрес = ES_YandexMaps.ПолучитьКоординаты(Элементы.Карта.Документ.parentWindow);
		БлижайшееМетро = ES_YandexMaps.ПолучитьМетро(Элементы.Карта.Документ.parentWindow);
		СтруктураГеокодирования.ФорматированныйАдрес = ВыбранныйАдрес.Адрес;
		СтруктураГеокодирования.Долгота = ВыбранныйАдрес.Долгота;
		СтруктураГеокодирования.Широта 	= ВыбранныйАдрес.Широта;
		СтруктураГеокодирования.Метро = БлижайшееМетро.Метро;
		СтруктураГеокодирования.Расстояние = БлижайшееМетро.Расстояние;

		
	КонецЕсли;
	
	Возврат СтруктураГеокодирования;	
	
КонецФункции

&НаКлиенте
Процедура КомандаСохранитьКоординаты(Команда)
	
	ТекущаяДолгота = ЭтаФорма.Элементы.Карта.Документ.parentWindow.eval("getCoord(""lat"")");
	ТекущаяШирота = ЭтаФорма.Элементы.Карта.Документ.parentWindow.eval("getCoord(""lng"")");
	
	ДанныеОТочке = Новый Структура;
	ДанныеОТочке = ES_OpenStreetMap.ПолучитьАдресПоКоординатам(ТекущаяДолгота, ТекущаяШирота);
	Закрыть(ДанныеОТочке);
		
	//СтруктураГеокодирования = ПолучитьСтруктуруГеокодирования();	
	//Закрыть(СтруктураГеокодирования);
	
КонецПроцедуры
