
#Область ПрограммныйИнтерфейс

Функция ОбработатьЗвонок(НомерКонтакта, Пользователь, ДатаЗвонка, ТипЗвонка, ВариантСобытия) Экспорт
	
	Возврат ТелефонияСервер.ОбработатьЗвонок(НомерКонтакта, Пользователь, ДатаЗвонка, ТипЗвонка, ВариантСобытия);
	
КонецФункции

Функция ПолучитьВходящийЗвонокПользователя(Пользователь = Неопределено) Экспорт
	
	Возврат ТелефонияСервер.ПолучитьВходящийЗвонокПользователя(Пользователь);
	
КонецФункции

Функция ПолучитьДанныеВходящегоЗвонка(ОчиститьДанные = Неопределено) Экспорт
	
	Возврат ТелефонияСервер.ПолучитьДанныеВходящегоЗвонка(ОчиститьДанные);
	
КонецФункции

Функция КорневойАдресАТС() Экспорт
	
	Возврат ТелефонияСервер.КорневойАдресАТС();
	
КонецФункции

Функция СоздатьОбсуждениеЖурналЗвонков() Экспорт
	
	Возврат ТелефонияСервер.СоздатьОбсуждениеЖурналЗвонков();
	
КонецФункции

Процедура ОбновитьЖурналЗвонков() Экспорт
	
	ТелефонияСервер.ОбновитьЖурналЗвонков();
	
КонецПроцедуры

Функция СсылкаНаЗаписьРазговора(ИдентификаторЗвонка, Ошибка) Экспорт
	
	Возврат ТелефонияПереопределяемый.СсылкаНаЗаписьРазговора(ИдентификаторЗвонка, Ошибка);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторОбсужденияЖурналЗвонков() Экспорт
	
	Возврат ТелефонияСервер.ИдентификаторОбсужденияЖурналЗвонков();
	
КонецФункции

Функция ПозвонитьПоНомеру(НомерАбонента, Событие, Ошибка, СтрокаПояснения) Экспорт
	
	Возврат ТелефонияСервер.ПозвонитьПоНомеру(НомерАбонента,,, Событие, Ошибка, СтрокаПояснения);
	
КонецФункции

#КонецОбласти