// Русанова М. 11.03.2019 (
Функция ПолучитьДанныеОНедоступности() Экспорт
		
	ТипИнформации = Справочники.ТипыИнформацииИнформационногоЦентра.НайтиПоНаименованию("Недоступность");
	
	Если НЕ ТипИнформации = Справочники.ТипыИнформацииИнформационногоЦентра.ПустаяСсылка() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеДанныеИнформационногоЦентра.Ссылка КАК Ссылка,
		|	РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(ОбщиеДанныеИнформационногоЦентра.ДатаНачалаАктуальности, ДЕНЬ, 1), МИНУТА) КАК КоличествоМинутДоНедоступности,
		|	ОбщиеДанныеИнформационногоЦентра.ТекстHTML КАК ТекстHTML,
		|	ДОБАВИТЬКДАТЕ (ОбщиеДанныеИнформационногоЦентра.ДатаНачалаАктуальности, ДЕНЬ, 1) КАК ДатаНачалаАктуальности,
		|	ОбщиеДанныеИнформационногоЦентра.ДатаОкончанияАктуальности КАК ДатаОкончанияАктуальности
		|ИЗ
		|	Справочник.ОбщиеДанныеИнформационногоЦентра КАК ОбщиеДанныеИнформационногоЦентра
		|ГДЕ
		|	ОбщиеДанныеИнформационногоЦентра.ТипИнформации = &ТипИнформации
		|   И РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(ОбщиеДанныеИнформационногоЦентра.ДатаНачалаАктуальности, ДЕНЬ, 1), МИНУТА) > -1
		|   И ОбщиеДанныеИнформационногоЦентра.ПометкаУдаления = Ложь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаАктуальности";
		
		Запрос.УстановитьПараметр("ТипИнформации", ТипИнформации);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			МассивДанныхОНедоступности = Новый Массив();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтруктураДанных = Новый Структура("Ссылка, КоличествоМинутДоНедоступности, ДатаНачалаАктуальности, ДатаОкончанияАктуальности, ПричинаНедоступности", 
				ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.КоличествоМинутДоНедоступности, ВыборкаДетальныеЗаписи.ДатаНачалаАктуальности,
				ВыборкаДетальныеЗаписи.ДатаОкончанияАктуальности, ПолучитьПричинуНедоступности(ВыборкаДетальныеЗаписи.ТекстHTML));
				МассивДанныхОНедоступности.Добавить(СтруктураДанных);
				
				Возврат МассивДанныхОНедоступности; 
				
			КонецЦикла;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПричинуНедоступности(ТекстHTML)
	Если СтрНайти(ТекстHTML, "<span>") > 0 Тогда
		НомерПервогоСимволаНачалальногоТега = СтрНайти(ТекстHTML, "<span>");
		НомерПервогоСимволаЗакрывающегоТега = СтрНайти(ТекстHTML, "</span>");
		КоличествоСимволовТега = СтрДлина("<span>");
		НомерПервогоСимволаПричиныНедоступности = НомерПервогоСимволаНачалальногоТега + КоличествоСимволовТега;
		ЧислоСимволовПричиныНедоступности = НомерПервогоСимволаЗакрывающегоТега - НомерПервогоСимволаПричиныНедоступности; 
		ПричинаНедоступности = Сред(ТекстHTML, НомерПервогоСимволаПричиныНедоступности, ЧислоСимволовПричиныНедоступности);
		Возврат ПричинаНедоступности;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Русанова М. 11.03.2019 )
