
&НаКлиенте
Перем мВыбраныСсылки;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Статус для установки параметром запроса	
	МассивСтатусов = Новый Массив;
	Если Параметры.ВидПодбора = "Платежи" Тогда
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ДоставленРассчитать);
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставленРассчитать);
	ИначеЕсли Параметры.ВидПодбора = "Заказы" Тогда
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.Отменен);
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставлен);
	КонецЕсли;
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("СтатусыЗаказов", МассивСтатусов);
	
	КонтрагентОтбора = Параметры.Контрагент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	мВыбраныСсылки = Новый Массив;
	КоличествоВыбранныхЗаказов = 0;
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(мВыбраныСсылки);
	
КонецПроцедуры

// НЕ ИСПОЛЬЗУЕТСЯ
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	//мВыбраныСсылки = Новый Массив;
	//Для каждого Стр Из Элементы.СписокЗаказов.ВыделенныеСтроки Цикл
	//	мВыбраныСсылки.Добавить(Стр.Заказ);
	//КонецЦикла; 
	//КоличествоВыбранныхЗаказов = мВыбраныСсылки.Количество();
	//
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	//Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры

// НЕ ИСПОЛЬЗУЕТСЯ
&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	//мВыбраныСсылки = Новый Массив;
	//КоличествоВыбранныхЗаказов = 0;
	//
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	//Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ ЗАКАЗЫ

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаЗаказ = Элемент.ТекущиеДанные.Заказ;
	
	мИндекс = мВыбраныСсылки.Найти(СсылкаНаЗаказ);
	Если мИндекс = Неопределено Тогда
		мВыбраныСсылки.Добавить(СсылкаНаЗаказ);
	Иначе
		мВыбраныСсылки.Удалить(мИндекс);
	КонецЕсли; 
	КоличествоВыбранныхЗаказов = мВыбраныСсылки.Количество();
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры


