
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеСообщенияСВ(ИдентификаторОбсуждения, ДанныеСообщения) Экспорт
	
	Возврат АссистентУправления.ДанныеСообщенияСВ(ИдентификаторОбсуждения, ДанныеСообщения);
	
КонецФункции

Процедура ОбработатьДействиеОтменаСообщенияАссистента(ОбсуждениеИдентификатор, СообщениеИдентификатор, ОтразитьРезультатСообщением = Истина) Экспорт
	
	АссистентУправления.ОбработатьДействиеОтменаСообщенияАссистента(ОбсуждениеИдентификатор, СообщениеИдентификатор, ОтразитьРезультатСообщением);
	
КонецПроцедуры

Процедура ПослеОбработкиДействияСообщенияАссистента(ОбсуждениеИдентификатор, СообщениеИдентификатор) Экспорт
	
	АссистентУправления.ПослеОбработкиДействияСообщенияАссистента(ОбсуждениеИдентификатор, СообщениеИдентификатор);
	
КонецПроцедуры

Процедура ОтветитьНаСообщение(ОбсуждениеИдентификатор, СообщениеИдентификатор, Результат) Экспорт
	
	АссистентУправления.ОтветитьНаСообщение(ОбсуждениеИдентификатор, СообщениеИдентификатор, Результат);
	
КонецПроцедуры

#КонецОбласти